ir_version: 3
producer_name: "onnx-tensorflow"
graph {
  node {
    input: "Placeholder"
    output: "Cast"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 11
      type: INT
    }
  }
  node {
    input: "nodes_output_layer/weights"
    output: "nodes_output_layer/weights/read"
    name: "nodes_output_layer/weights/read"
    op_type: "Identity"
  }
  node {
    input: "Cast"
    input: "nodes_output_layer/weights/read"
    output: "nodes_output_layer/MatMul"
    name: "nodes_output_layer/MatMul"
    op_type: "MatMul"
  }
  node {
    input: "nodes_output_layer/biases"
    output: "nodes_output_layer/biases/read"
    name: "nodes_output_layer/biases/read"
    op_type: "Identity"
  }
  node {
    input: "nodes_output_layer/MatMul"
    input: "nodes_output_layer/biases/read"
    output: "nodes_output_layer/add"
    name: "nodes_output_layer/add"
    op_type: "Add"
    attribute {
      name: "broadcast"
      i: 1
      type: INT
    }
  }
  name: "nodes_output_layer/add"
  initializer {
    dims: 784
    dims: 10
    data_type: DOUBLE
    name: "nodes_output_layer/weights"
    double_data: 0.0015614007167995842
    double_data: 0.02688727687094296
    double_data: 0.02488969562631631
    double_data: 0.01719651450733957
    double_data: 0.024023015992132923
    double_data: -0.0003816288218752035
    double_data: -0.025842276649251
    double_data: -0.043006019161279496
    double_data: 0.053875349460210505
    double_data: 0.022425841097127613
    double_data: -0.03148893339910721
    double_data: -0.03825108118405148
    double_data: -0.03994697315766967
    double_data: -0.01056083416019949
    double_data: 0.006562862800831289
    double_data: 0.013394971385821497
    double_data: -0.012429614880291295
    double_data: 0.036470413210544006
    double_data: 0.000972475940562515
    double_data: 0.03565864111914652
    double_data: 0.009065603251031234
    double_data: -0.04542901861468138
    double_data: -0.0024940649630603245
    double_data: -0.015621957357218988
    double_data: 2.877059326162272e-05
    double_data: 0.009731333624730098
    double_data: -0.011650218186056657
    double_data: -0.0021705852558328124
    double_data: 0.010583468749684619
    double_data: -0.012484370919617668
    double_data: -0.032887649449560956
    double_data: 0.01496484236809629
    double_data: -0.03472479998618802
    double_data: 0.011843689379602307
    double_data: -0.0034610743462542616
    double_data: 0.024162107391529204
    double_data: 0.007810100455160261
    double_data: -0.057947347306129465
    double_data: 0.03179442401430797
    double_data: 0.04666813882425075
    double_data: -0.0294185534180839
    double_data: 0.014044426925956841
    double_data: -0.0005400297736093961
    double_data: -0.06636028689533692
    double_data: 0.010580255436104236
    double_data: -0.008457777473014919
    double_data: 0.024525961365123198
    double_data: 0.006719128748831381
    double_data: 0.011831984623671273
    double_data: -0.03513119530343526
    double_data: 0.0075607769006374136
    double_data: 0.049309078845486104
    double_data: 0.006196984319343161
    double_data: 0.0425935212149011
    double_data: 0.011691741623319853
    double_data: -0.02156340336181192
    double_data: -0.0366703611100934
    double_data: -0.034020912311868344
    double_data: 0.0023168092060017404
    double_data: 0.026491073721746985
    double_data: 0.018859720251610753
    double_data: 0.041490840288919216
    double_data: -0.01861344454590328
    double_data: 0.027803376198923178
    double_data: -0.038922857095350004
    double_data: -0.04969739273787357
    double_data: 0.01639639160096338
    double_data: 0.029340617084271076
    double_data: -0.048877674746490934
    double_data: 0.006352884298331255
    double_data: 0.018084163133362915
    double_data: 0.01833779250330423
    double_data: -0.012160273009584287
    double_data: 0.04808977563030224
    double_data: -0.03229621576105838
    double_data: 0.012831101571127301
    double_data: 0.020260669258150968
    double_data: 0.04492857458714231
    double_data: 0.002710691664785837
    double_data: 0.00304334388113682
    double_data: -0.015529293005566174
    double_data: 0.01765929243085376
    double_data: 0.03524180005526758
    double_data: 9.134313563298844e-06
    double_data: -0.03728506103731478
    double_data: -0.027682157966414583
    double_data: -0.0056909947131834875
    double_data: -0.021882065335820277
    double_data: 0.042654643810087677
    double_data: 0.039406998011050326
    double_data: 0.039627823524466414
    double_data: 0.013943535142925368
    double_data: 0.05714705357677239
    double_data: 0.020703868235025232
    double_data: 0.02055305807290186
    double_data: 0.02727651787667127
    double_data: -0.015584311245708651
    double_data: 0.022703537760854715
    double_data: -0.05011148884672659
    double_data: 0.011535616876569168
    double_data: 0.027760240875929043
    double_data: -0.004882376788873891
    double_data: -0.024273747318910206
    double_data: 0.0004260755809771206
    double_data: 0.03513120720624846
    double_data: -0.035808769290464455
    double_data: -0.06161254055996243
    double_data: -0.0013884640068288917
    double_data: -0.027193610579056383
    double_data: -0.05624779907289091
    double_data: 0.025571460979279096
    double_data: -0.02513289807811246
    double_data: 0.013712830472212126
    double_data: -0.00831670256253271
    double_data: 0.034674008126472707
    double_data: 0.022051455541344907
    double_data: -0.008193533842930116
    double_data: 0.020194284158486644
    double_data: 0.002245025509626846
    double_data: -0.017132644386234616
    double_data: 0.030082996551390257
    double_data: 0.021342101083200792
    double_data: 0.03836510132120576
    double_data: -0.05537879969185799
    double_data: -0.03961927608613143
    double_data: 0.00020832995666269073
    double_data: 0.039629767265594744
    double_data: 0.013225793978863047
    double_data: -0.00943104529829626
    double_data: -0.046208579966000245
    double_data: -0.004066741024657434
    double_data: 0.05645343451116934
    double_data: -0.030892276602599824
    double_data: -0.019713760228999656
    double_data: -0.05657122746574635
    double_data: -0.00022963599880721563
    double_data: 0.02259711826515388
    double_data: 0.015069121124823361
    double_data: -0.05603037976435751
    double_data: -0.02064827368312497
    double_data: -0.04472498403736576
    double_data: 0.020235543458668022
    double_data: 0.024165181145362275
    double_data: 0.009531788967916873
    double_data: -0.036522503802006966
    double_data: 0.04693450064892909
    double_data: -0.019403008518703257
    double_data: -0.003953160667604353
    double_data: -0.01876488668281597
    double_data: 0.03569437731369118
    double_data: -0.028235019832529372
    double_data: 0.015533276085109854
    double_data: -0.030332032911934953
    double_data: -0.00340253870693752
    double_data: -0.03176071779165952
    double_data: 0.06959362839214761
    double_data: 0.002120926735521876
    double_data: -0.00566514500811627
    double_data: -0.022592590650966585
    double_data: -0.013512613084755388
    double_data: -0.017465599154360363
    double_data: -0.047926569437009806
    double_data: -0.04316443414569065
    double_data: 0.036273074725886145
    double_data: 0.0371833523217086
    double_data: 0.03743425850847776
    double_data: -0.061371893777910996
    double_data: -0.048504402247532746
    double_data: 0.03569266790508116
    double_data: -0.061831467451929786
    double_data: -0.026162431576933584
    double_data: -0.009920380305257402
    double_data: 0.003511255302641317
    double_data: 0.026775416238818576
    double_data: -0.07062862255467457
    double_data: 0.0573958334254123
    double_data: -0.013090445931122824
    double_data: 0.015280131081789671
    double_data: 0.012347239655617336
    double_data: -0.006324132547658259
    double_data: 0.04687151703080833
    double_data: -0.022779885468873624
    double_data: -0.04250089913895734
    double_data: -0.04232186578907266
    double_data: -0.032899480268069416
    double_data: 0.0013781114291927456
    double_data: -0.011305941634932575
    double_data: 0.006767057017477712
    double_data: -0.04687846483098481
    double_data: -0.006482354888518582
    double_data: -0.00572372392246406
    double_data: -0.00479590415591812
    double_data: 0.02318036266582153
    double_data: -0.03547827638202161
    double_data: -0.0008232690271573452
    double_data: -0.01473385715204117
    double_data: -0.002745047351813843
    double_data: 0.03418545895669931
    double_data: -0.01713954981988826
    double_data: -0.003973114864985545
    double_data: 0.0031414053752293757
    double_data: 0.033797412642265164
    double_data: 0.019472240150050057
    double_data: 0.02399834314961226
    double_data: -0.019802866650889234
    double_data: 0.026170988304990084
    double_data: 0.05165591624138246
    double_data: -0.0005306645436773714
    double_data: -0.012420196805481148
    double_data: 0.014991970498905237
    double_data: -0.05924935627679274
    double_data: -0.025758771123849403
    double_data: 0.002533495336366582
    double_data: 0.04583797206336347
    double_data: -0.0038639009334163013
    double_data: -0.013471676078355385
    double_data: 0.028827052607021324
    double_data: -0.0072497088206111455
    double_data: 0.040697299175515234
    double_data: 0.01161089236560753
    double_data: 0.012784714169694596
    double_data: -0.01182130030188673
    double_data: 0.0001706601828612954
    double_data: -0.0034350144119277815
    double_data: 0.04662496384496728
    double_data: -0.027720340869657734
    double_data: 0.026426667566897214
    double_data: -0.04274388178612128
    double_data: 0.06648051942565257
    double_data: 0.03664037991802789
    double_data: 0.0017755444027061729
    double_data: -0.020962426814151287
    double_data: -0.03290545573665154
    double_data: 0.0544301283239059
    double_data: -0.018526953626015155
    double_data: -0.05369953068465817
    double_data: 0.029860051239125645
    double_data: 0.05753185540163408
    double_data: 0.021358168231910373
    double_data: -0.004645745252573324
    double_data: -0.0024325910966161925
    double_data: -0.027083756353412803
    double_data: -0.019327354541267435
    double_data: 0.007077387390545467
    double_data: -0.015606864400300307
    double_data: -0.022072384024692207
    double_data: -0.025586450130123315
    double_data: 0.0044546606062954705
    double_data: -0.01262955843197069
    double_data: 0.0334181047252859
    double_data: 0.017453294798015155
    double_data: -0.020587760516872042
    double_data: -0.0035700539684523983
    double_data: -0.04939503510072171
    double_data: 0.016539363582449618
    double_data: -0.045266845182022813
    double_data: -0.05214343284491848
    double_data: 0.04952970485509231
    double_data: 0.030902823149040092
    double_data: -0.03103222617414604
    double_data: 0.02120196810413237
    double_data: 0.023634027510083096
    double_data: -0.03690448908279575
    double_data: -0.04144537803324157
    double_data: -0.021950841683459895
    double_data: -0.04500439730079501
    double_data: -0.007836536944188285
    double_data: -0.039712100936515185
    double_data: -0.023184335600834514
    double_data: 0.0028759259676211413
    double_data: -0.02935197514656935
    double_data: 0.029752528672459706
    double_data: -0.03918716145953341
    double_data: -0.006417071574334175
    double_data: 0.027320903018491424
    double_data: 0.005309260403874256
    double_data: 0.032100308577537935
    double_data: -0.04151212453439003
    double_data: 0.0005405580998652887
    double_data: 0.03511678345745494
    double_data: -0.022856424319949734
    double_data: 0.02943032047930809
    double_data: 0.017384459379262838
    double_data: -0.01730671010696934
    double_data: -0.02380679909852213
    double_data: 0.03953609609681427
    double_data: 0.01768013771672864
    double_data: 0.0371033272155504
    double_data: 0.024114563025605534
    double_data: 0.033839599443138635
    double_data: 0.015641980397653025
    double_data: 0.01848637850777719
    double_data: 0.015121206247913183
    double_data: 0.01021098211484609
    double_data: -0.011164054143337371
    double_data: -0.006956516173265252
    double_data: -0.039587853241719
    double_data: -0.05098361609790925
    double_data: -0.05822137187401392
    double_data: 0.02064188622659359
    double_data: 0.03476662422915103
    double_data: 0.013539899801669192
    double_data: -0.02793837775386978
    double_data: 0.038315309537202295
    double_data: -0.003469919780863197
    double_data: 0.0012328972098396044
    double_data: -0.02851665416619641
    double_data: -0.01369887883566534
    double_data: 0.03125591922923013
    double_data: 0.05312776477686125
    double_data: 0.007342750060529738
    double_data: 0.024855584658304324
    double_data: -0.0070458124149690785
    double_data: 0.007500043266140871
    double_data: -0.004266618723713406
    double_data: -0.013026329388417754
    double_data: 0.014442706104863425
    double_data: 0.00213800202129077
    double_data: 0.06955441382139971
    double_data: 0.0008113518621617406
    double_data: -0.021429996356698195
    double_data: -0.022094251349400174
    double_data: -0.019484257136875488
    double_data: 0.012881105418225933
    double_data: -0.03324049811415811
    double_data: -0.02671613242348527
    double_data: 0.005372224066208472
    double_data: 0.02365023466445056
    double_data: -0.009768641517100619
    double_data: -0.007365037345097569
    double_data: 0.05482602190897282
    double_data: -0.044923161850191955
    double_data: -0.058989016603139856
    double_data: -0.033979794690444085
    double_data: 0.02486826536361773
    double_data: -0.03996093444465501
    double_data: 0.031926442563906685
    double_data: -0.046742394035708915
    double_data: -0.05269673442995211
    double_data: -0.010905247862579244
    double_data: 0.02192971364286733
    double_data: -0.04520545197604979
    double_data: 0.011991923289692633
    double_data: -0.002895826615206144
    double_data: -0.05116473115066874
    double_data: -0.00310052380762657
    double_data: 0.009054732836242451
    double_data: -0.020239042178103704
    double_data: -0.038100782653948846
    double_data: 0.03504669988937097
    double_data: 0.031035645044151322
    double_data: -0.06204582093135979
    double_data: 0.031032623326383308
    double_data: -0.0009667411397752722
    double_data: -0.09686854153263612
    double_data: 0.0236042208200524
    double_data: 0.06430723378185413
    double_data: 0.028338904718444
    double_data: 0.023973332939188793
    double_data: -0.027202114946958383
    double_data: 0.03697830534624167
    double_data: -0.031169935496672917
    double_data: -0.06084281776060708
    double_data: -0.01554387105154513
    double_data: -0.15058837816669612
    double_data: -0.025194176944813323
    double_data: 0.1306222612992687
    double_data: 0.012042595379471397
    double_data: -0.02216481562152947
    double_data: 0.023440718057362423
    double_data: -0.017949332979434643
    double_data: -0.021715136700544237
    double_data: -0.011061598925168292
    double_data: -0.03959478045262962
    double_data: -0.03543027042457069
    double_data: 0.025976120653292627
    double_data: 0.043381432837528454
    double_data: -0.026642337195032038
    double_data: 0.020880585020386585
    double_data: -0.004626876144265633
    double_data: 0.0066326256636304315
    double_data: -0.01433965246316669
    double_data: -0.011204855120786176
    double_data: -0.0637744520070717
    double_data: -0.009307344641908669
    double_data: 0.05091598231302086
    double_data: 0.06421817215903163
    double_data: 0.009833708836366589
    double_data: 0.05068868202776531
    double_data: -0.020290374904770158
    double_data: 0.02475334231410245
    double_data: -0.02585639158296275
    double_data: 0.01948880929409619
    double_data: -0.003232209853442557
    double_data: -0.0595008721199183
    double_data: 0.03564854493940909
    double_data: 0.09658521278168268
    double_data: -0.023368298665122744
    double_data: 0.032332249647746475
    double_data: -0.010285986490794624
    double_data: 0.12603399568447823
    double_data: -0.05826769642695682
    double_data: 0.034963693337645554
    double_data: 0.06712407140171534
    double_data: -0.24158923738450985
    double_data: -0.03648160244364239
    double_data: 0.17578466076837523
    double_data: -0.060059484990608654
    double_data: 0.0073849289879098804
    double_data: -0.011400321020221144
    double_data: 0.0048938812628479995
    double_data: 0.023146663614289104
    double_data: 0.022480910320845378
    double_data: 0.038032010363503226
    double_data: -0.15666225370884812
    double_data: 0.014633308456762875
    double_data: 0.05154364162094196
    double_data: -0.037397481561271075
    double_data: -0.04449598541726082
    double_data: -0.011559495040469315
    double_data: 0.03137632181667854
    double_data: 0.0010303928323374748
    double_data: -0.0287334109165246
    double_data: 0.008681100996159314
    double_data: 0.011949908982989265
    double_data: 0.03826677741712438
    double_data: 0.03367917207185021
    double_data: 0.025977551470105092
    double_data: -0.03768717619231253
    double_data: 0.014663133626691928
    double_data: 0.041207778083707305
    double_data: 0.059206487819767326
    double_data: 0.033900588849495365
    double_data: 0.024545169288019728
    double_data: -0.06637236127125531
    double_data: -0.016959650383584834
    double_data: 0.031010872990922225
    double_data: -0.0003410295760235684
    double_data: 0.005496078998300292
    double_data: -0.04037806950110224
    double_data: 0.03950674814827872
    double_data: 0.05435328552248233
    double_data: 0.1440543619743005
    double_data: -0.04284934287791884
    double_data: -0.1357041983211806
    double_data: 0.04389626636074618
    double_data: 0.05411645002495229
    double_data: -0.04946683443001183
    double_data: -0.031851935900539086
    double_data: -0.07012375764648668
    double_data: -0.008240112975225037
    double_data: -0.015885671349742007
    double_data: -0.015585977111506406
    double_data: 0.028071134648132504
    double_data: -0.09487280005549752
    double_data: -0.03657138107831018
    double_data: 0.04315661542434266
    double_data: -0.06908836030432297
    double_data: -0.013648194573453017
    double_data: -0.015011213194957395
    double_data: -0.07240028491040418
    double_data: -0.0663461656609035
    double_data: -0.06660447337973066
    double_data: 0.021052297762753424
    double_data: -0.008422413703789353
    double_data: -0.045997618539631406
    double_data: 0.09885222332730305
    double_data: -0.0007244118840712601
    double_data: 0.02365391845940563
    double_data: 0.02968331572644268
    double_data: -0.07154146444860605
    double_data: 0.009215899221335836
    double_data: 0.04371979818251015
    double_data: -0.024362999248144696
    double_data: -0.008620863782033552
    double_data: 0.040316188098520875
    double_data: 0.057557955170730556
    double_data: 0.06453093840039739
    double_data: -0.03038556608696708
    double_data: 0.0023062856478605538
    double_data: 0.001481856339496326
    double_data: 0.04896075300298148
    double_data: -0.0006414822674583375
    double_data: -0.03687026854635352
    double_data: -0.020150297406648726
    double_data: -0.003643263121716163
    double_data: 0.06552474219633296
    double_data: -0.040259456793236184
    double_data: 0.02720176959563515
    double_data: -0.0018169027458156588
    double_data: -0.013418291352403409
    double_data: -0.04651407884936873
    double_data: -0.017117068332625763
    double_data: -0.003106921676355373
    double_data: -0.000933944259705285
    double_data: 0.051368804446178536
    double_data: 0.05111013982885656
    double_data: -0.021389384073692355
    double_data: -0.019006272100038888
    double_data: -0.028192788335968333
    double_data: -0.034811086970289284
    double_data: 0.0076925171758257605
    double_data: -0.012810424545472343
    double_data: -0.004210437000380092
    double_data: -0.06694319977273461
    double_data: 0.001981034230240797
    double_data: 0.07456765376675896
    double_data: -0.052383204106683116
    double_data: -0.02358385632811049
    double_data: 8.309889441086579e-05
    double_data: -0.008615526286692968
    double_data: 0.025793909520671187
    double_data: 0.05121260412177968
    double_data: 0.009153582605931762
    double_data: -0.01451353039980285
    double_data: 0.008742976388784003
    double_data: 0.006017402197309959
    double_data: -0.04358237876260946
    double_data: -0.024208276565614445
    double_data: -0.010016816760229518
    double_data: 0.004648981631010055
    double_data: 0.06454933958373323
    double_data: 0.011016631108623413
    double_data: 0.009099191368993398
    double_data: -0.032114274369995525
    double_data: -0.00931178018216088
    double_data: 0.01581321614899928
    double_data: 0.04428851795557204
    double_data: 0.04481833283656034
    double_data: 0.03846109467151696
    double_data: -0.014452854394928102
    double_data: 0.03407943101796448
    double_data: -0.05141278149676887
    double_data: 0.005408942700371344
    double_data: 0.02567162538566719
    double_data: -0.02599979426545662
    double_data: 0.06434203430066056
    double_data: -0.03483374866253604
    double_data: 0.006663447942629457
    double_data: -0.01213685595030615
    double_data: 0.05498788561127812
    double_data: 0.00021206526072086113
    double_data: -0.023547834162085394
    double_data: -0.028166578184407442
    double_data: 0.051984223831379815
    double_data: -0.020466461511452722
    double_data: -0.027127699154443068
    double_data: 0.010649123895278032
    double_data: 0.038207965090241304
    double_data: 0.008490390196232926
    double_data: -0.003823305276127775
    double_data: -0.04221880177175069
    double_data: 0.024666933769355654
    double_data: 0.02430619399792268
    double_data: -0.02581017055691407
    double_data: 0.026464148358962457
    double_data: -0.06828555547238709
    double_data: 0.04244100100295514
    double_data: 0.017228804861305975
    double_data: 0.02730078769358668
    double_data: 0.01880445898247761
    double_data: 0.00824583875048881
    double_data: -0.02983833342818571
    double_data: 0.03322753401335985
    double_data: 0.014881528629873346
    double_data: 0.027466033707921687
    double_data: 0.0031740734459027925
    double_data: -0.02284808433098715
    double_data: -0.0443156805380557
    double_data: 0.029167043093553346
    double_data: -0.02072747045724067
    double_data: -0.012673521817840464
    double_data: 0.05524871987207764
    double_data: -0.04293300859506029
    double_data: 0.01129519642374063
    double_data: 0.022011952294067025
    double_data: -0.0426109632328252
    double_data: -0.017310535396300303
    double_data: 0.010474834179553553
    double_data: 0.031125196439714016
    double_data: -0.0022209779370497484
    double_data: 0.0009139561029037125
    double_data: -0.011916295727268607
    double_data: -0.024536223663027122
    double_data: -0.04666410989993353
    double_data: -0.0018224872494872514
    double_data: 0.03793437540334599
    double_data: 0.0411665035791968
    double_data: 0.03234535535239898
    double_data: 0.013881220291138646
    double_data: -0.029837095525335384
    double_data: -0.01928184807288454
    double_data: 0.059299130516655
    double_data: -0.025630468653141433
    double_data: 0.043992069332914885
    double_data: -0.020396741223271737
    double_data: -0.06165257150150755
    double_data: -0.023038519355557407
    double_data: -0.0081693520478136
    double_data: 0.02271969063994283
    double_data: -0.017698076519769426
    double_data: -0.03135515932784716
    double_data: 0.021857695168272524
    double_data: -0.06206450655802326
    double_data: -0.0676077361959977
    double_data: 0.024453841098780404
    double_data: -0.03969375064107722
    double_data: 0.002360732592003312
    double_data: 0.021296438272513755
    double_data: -0.032910776721653934
    double_data: 0.0007607708339184098
    double_data: -0.044650931996080556
    double_data: -0.0024771538577907084
    double_data: 0.022297546096452615
    double_data: -0.013343643065537838
    double_data: 0.03677098877772393
    double_data: 0.0404774430920514
    double_data: -0.02208952897790698
    double_data: -0.03875848949755028
    double_data: -0.01273489521245415
    double_data: -0.05860220396460449
    double_data: 0.04459984724383105
    double_data: -0.01685041940468418
    double_data: 0.011623625982174769
    double_data: -0.07918194668920749
    double_data: -0.004291609516764014
    double_data: 0.06761319153582761
    double_data: 0.0494429392726083
    double_data: -0.03732516244485473
    double_data: 0.022299412572829
    double_data: -0.0570942289590542
    double_data: 0.054098646834393034
    double_data: -0.06827733630307929
    double_data: 0.024567579471895088
    double_data: -0.18511975440237155
    double_data: -0.028606647352575714
    double_data: 0.21933653193923522
    double_data: -0.055658476616137
    double_data: -0.047979983237806306
    double_data: 0.0019889085395433277
    double_data: -0.07290965743038746
    double_data: -0.01354224383885622
    double_data: 0.016574348790492938
    double_data: -0.00564669137306193
    double_data: -0.14116259972468304
    double_data: -0.06614408735003291
    double_data: 0.28565618939228044
    double_data: -0.023320615747538496
    double_data: 0.015581300625945134
    double_data: 0.00262072567274833
    double_data: -0.0030530536044848667
    double_data: -0.08496536863131156
    double_data: 0.16988465158622898
    double_data: 0.025435189388572546
    double_data: -0.1908122392286436
    double_data: -0.0022075903953511933
    double_data: 0.20153433535870302
    double_data: -0.008300060187250683
    double_data: 0.026851415664661593
    double_data: 0.021217760021056502
    double_data: -0.012076106052462158
    double_data: -0.06871630395999329
    double_data: 0.0892572215218469
    double_data: 0.02087530893309378
    double_data: -0.21688574824585885
    double_data: -0.018404346982142262
    double_data: 0.38497228049246435
    double_data: -0.0327545417694752
    double_data: -0.015553359613533048
    double_data: -0.052203249750076834
    double_data: -0.07297790813214947
    double_data: -0.047329911587619754
    double_data: 0.12961646034763843
    double_data: 0.021960423587244437
    double_data: -0.30518234546525713
    double_data: -0.11607402524675402
    double_data: 0.4005725699991828
    double_data: -0.03595295896929248
    double_data: -0.016965645771199512
    double_data: -0.029343376400082232
    double_data: -0.043898197658947445
    double_data: 0.02548589088598615
    double_data: 0.10168300870985811
    double_data: 0.03574642230213587
    double_data: -0.33648036691300814
    double_data: -0.13483220036921376
    double_data: 0.5533280638009181
    double_data: -0.10209251008847592
    double_data: 0.006483895352709197
    double_data: -0.07423608578947789
    double_data: -0.06308083412468271
    double_data: 0.16336663836997686
    double_data: 0.01949640339354974
    double_data: -0.035304883038174015
    double_data: -0.2932826306297805
    double_data: -0.14712626665748293
    double_data: 0.3952639311500133
    double_data: -0.03788557954308809
    double_data: -0.11508105271675415
    double_data: -0.029621266131198143
    double_data: -0.17255520422484033
    double_data: 0.14579272198528273
    double_data: 0.014356921341918336
    double_data: -0.023251533294503548
    double_data: -0.15997768238005286
    double_data: -0.1133641058099019
    double_data: 0.3413925829617111
    double_data: -0.0035031649394220406
    double_data: -0.10578465177025984
    double_data: -0.06707827754977078
    double_data: -0.11440367214430304
    double_data: 0.2986409956095537
    double_data: 0.20626505955636815
    double_data: -0.04113363467281671
    double_data: -0.30861235686468674
    double_data: -0.11566924889159934
    double_data: 0.25792254382204965
    double_data: -0.05018107250194214
    double_data: -0.11230048228875318
    double_data: -0.012961914192617763
    double_data: -0.16678600099605462
    double_data: 0.21852649629180493
    double_data: 0.17779191607539138
    double_data: -0.07543868414482156
    double_data: -0.3138071826609268
    double_data: 0.008514202746478882
    double_data: 0.2527686751799979
    double_data: -0.0036456102655506215
    double_data: -0.07471211496826378
    double_data: -0.0377127759558455
    double_data: -0.09394189234472948
    double_data: 0.05265975843217647
    double_data: 0.033690423049169735
    double_data: -0.06356738126828804
    double_data: -0.10730336879710502
    double_data: 0.10747116333500661
    double_data: 0.2832867967212741
    double_data: 0.005639501973975048
    double_data: -0.009022342901816036
    double_data: -0.049168940094043385
    double_data: -0.021575004137872444
    double_data: 0.027920709154375334
    double_data: -0.0008293980839580491
    double_data: -0.12412386930531757
    double_data: -0.10688330914399857
    double_data: 0.1396721780701488
    double_data: 0.29139261394307076
    double_data: -0.03304787730505065
    double_data: 0.010169504725367646
    double_data: -0.06973898779581687
    double_data: -0.0529330411022597
    double_data: 0.0455084318177257
    double_data: -0.09525790282161069
    double_data: 0.003575816751186305
    double_data: -0.10242419769141879
    double_data: 0.033271545415326634
    double_data: 0.28512188923957893
    double_data: -0.01355520466359987
    double_data: -0.02705183877915093
    double_data: -0.043269974378126
    double_data: -0.026805233620179603
    double_data: -0.02316883155783186
    double_data: -0.04451823147889712
    double_data: -0.03632949915822681
    double_data: -0.02469018043969875
    double_data: -0.05938754311812811
    double_data: 0.19326956987258606
    double_data: 0.005078938557633691
    double_data: -0.01046000237306571
    double_data: -0.01027070907426456
    double_data: -0.016575164505943124
    double_data: 0.0019708630183959915
    double_data: -0.06811419732592632
    double_data: -0.0048134467101164724
    double_data: -0.07601470784011093
    double_data: -0.07953146760244538
    double_data: 0.23722619559091954
    double_data: -0.005795290656220276
    double_data: -0.0461689245271042
    double_data: 0.016831438911703578
    double_data: 0.012823245014990693
    double_data: -0.017476085108507754
    double_data: -0.028137743326671766
    double_data: -0.0013113705945495522
    double_data: -0.10240057876948006
    double_data: -0.04113250743064905
    double_data: 0.17873320135569468
    double_data: -0.015488452655351202
    double_data: 0.0026959488934665994
    double_data: 0.0031418416355363443
    double_data: -0.013815707655708855
    double_data: 0.03256252854540349
    double_data: 0.0009199292225712742
    double_data: -0.03895697253295334
    double_data: -0.04104676269357411
    double_data: -0.10819706175478706
    double_data: 0.07994624478056675
    double_data: 0.019288984435312618
    double_data: 0.04005842751248132
    double_data: 0.04538371281088405
    double_data: -0.02101953740023517
    double_data: 0.011267115366887612
    double_data: 0.03791073404291209
    double_data: -0.04641950846908657
    double_data: -0.0005140775409974134
    double_data: 0.009201375299424082
    double_data: 0.03436185189729383
    double_data: -0.015428374549711622
    double_data: -0.05450502062233422
    double_data: 0.0001829564608498257
    double_data: 0.03438771132162988
    double_data: -0.015649580071801335
    double_data: 0.020342399414256793
    double_data: -0.025402231027028953
    double_data: 0.005938663282650212
    double_data: 0.01544373068775164
    double_data: -0.04692050499597473
    double_data: 0.013562129799358644
    double_data: -0.03537560806297029
    double_data: -0.02363872565903178
    double_data: -0.06659104983313124
    double_data: -0.01705021516038931
    double_data: -0.009505896811881652
    double_data: 0.05185758564265669
    double_data: -0.004784963128459723
    double_data: 0.014377845193863389
    double_data: 0.0005514545706486704
    double_data: -0.021637926745436936
    double_data: 0.007524277942264441
    double_data: -0.029103120134181665
    double_data: -0.013312599277296763
    double_data: -0.0688859392041586
    double_data: 0.0362844826478374
    double_data: 0.01932304357588897
    double_data: 0.039239918027336444
    double_data: -0.012141221548061604
    double_data: 0.005897897873450977
    double_data: -0.02396567062920336
    double_data: 0.008666667125395636
    double_data: -0.009292831539116905
    double_data: -0.015340969316780102
    double_data: 0.0495639523252312
    double_data: 0.05485275497097346
    double_data: -0.022645241190855037
    double_data: 0.02296451959607693
    double_data: -0.0007667392376125116
    double_data: -0.005654322528286595
    double_data: -0.013061341101261328
    double_data: -0.027363627377304182
    double_data: 0.05327769869910462
    double_data: 0.02443217173722254
    double_data: 0.006264689416377601
    double_data: 0.03989991154501519
    double_data: -0.004109122888975439
    double_data: 0.012073114473538073
    double_data: 0.030507284591436118
    double_data: -0.00939431081504404
    double_data: 0.012384426477195907
    double_data: 0.012575433460299282
    double_data: -0.05982881145124142
    double_data: 0.026191197616252576
    double_data: 0.019592229679517136
    double_data: -0.017552092252414865
    double_data: 0.004414768167892189
    double_data: 0.019809482450655037
    double_data: -0.005378651517336876
    double_data: 0.007580563448786265
    double_data: -0.003697589211069429
    double_data: 0.025605203054815458
    double_data: -0.006387873684418854
    double_data: 0.030184296946436078
    double_data: 0.0008519249335517483
    double_data: 0.05675709800107422
    double_data: -0.014168040179290813
    double_data: -0.02890649052214263
    double_data: -0.03207100884156485
    double_data: 0.061812261453169676
    double_data: -0.01867114483637745
    double_data: 0.024085320446027
    double_data: -0.03575823210570866
    double_data: -0.00926433978503705
    double_data: -0.0042273561756293035
    double_data: 0.006423140245524511
    double_data: -0.01678481774983959
    double_data: 0.0037330341657412173
    double_data: 0.06253354822776278
    double_data: 0.0370974125961711
    double_data: -0.01210771803524348
    double_data: -0.024495079175505002
    double_data: 0.022929255907616675
    double_data: -0.09170262853357787
    double_data: -0.049422870200523
    double_data: 0.003592352935129496
    double_data: 0.07785703572090268
    double_data: 0.002338473349321262
    double_data: -0.044499866170785364
    double_data: -0.012345141260015536
    double_data: 0.0690357141027247
    double_data: 0.06145720733652742
    double_data: -0.0019518768320631594
    double_data: -0.13527195070827067
    double_data: -0.014533155872944865
    double_data: -0.061577617647727914
    double_data: 0.0904730031857011
    double_data: -0.13773700385263812
    double_data: -0.006432021067367615
    double_data: 0.1434152131112984
    double_data: -0.05119383812941842
    double_data: -0.03082411973053878
    double_data: 0.0362143029502983
    double_data: -0.08840568533661101
    double_data: -0.01666319552078443
    double_data: 0.046825755037529726
    double_data: 0.12665989630385907
    double_data: -0.11266414809026204
    double_data: -0.04518866701091942
    double_data: 0.200837193438906
    double_data: -0.06259926132269845
    double_data: -0.010748579814127204
    double_data: -0.02524573478447125
    double_data: 0.019678807588967694
    double_data: -0.1266187304727685
    double_data: 0.1634919796157224
    double_data: 0.2017808509299928
    double_data: -0.2951717547720495
    double_data: -0.06580192085669961
    double_data: 0.265977049146535
    double_data: -0.12140732253306713
    double_data: 0.010081868239419006
    double_data: 0.011168210069433946
    double_data: -0.03501881641009066
    double_data: -0.09943228304244034
    double_data: 0.4291249135531872
    double_data: 0.018826515272509583
    double_data: -0.40494202351997666
    double_data: -0.08533476695963284
    double_data: 0.24241398975201398
    double_data: -0.020988444853153442
    double_data: -0.04981296269332783
    double_data: -0.013129531431647563
    double_data: -0.07698374740446635
    double_data: -0.20545254490426298
    double_data: 0.41373543909178556
    double_data: 0.2044913423003505
    double_data: -0.3957199505798774
    double_data: -0.10526472089706394
    double_data: 0.28398102118635443
    double_data: -0.10507459707529117
    double_data: 0.024949577258911046
    double_data: -0.07346983549242805
    double_data: 0.05263397490185696
    double_data: -0.30940714095921
    double_data: 0.42684520955402766
    double_data: 0.4291153458023758
    double_data: -0.5137059405991029
    double_data: -0.13151740951157861
    double_data: 0.3497226524787459
    double_data: -0.14652484392754667
    double_data: -0.10630439943639336
    double_data: -0.09439076220455732
    double_data: 0.03274002400094634
    double_data: -0.15702607010464759
    double_data: 0.4008457181627334
    double_data: 0.5222315296931257
    double_data: -0.6252493637614698
    double_data: -0.03173678350339161
    double_data: 0.24265918349556492
    double_data: -0.10678389458185626
    double_data: -0.1411236202352715
    double_data: -0.10795951021777507
    double_data: 0.21411367060163705
    double_data: -0.07172369258458507
    double_data: 0.5442406214234511
    double_data: 0.2983592232332321
    double_data: -0.8550615367448497
    double_data: -0.07393095617469755
    double_data: 0.28823447966808424
    double_data: -0.17217974888261678
    double_data: -0.10852013526354296
    double_data: -0.20296017451242124
    double_data: 0.15681975857076297
    double_data: -0.12156109092176079
    double_data: 0.34274788522256533
    double_data: 0.5578207252994044
    double_data: -0.5582399542810373
    double_data: -0.05521944721761585
    double_data: 0.2562631090406298
    double_data: -0.10818720566625435
    double_data: -0.23331244154543315
    double_data: -0.19785245033958757
    double_data: 0.09397207704943424
    double_data: 0.028860816245275474
    double_data: 0.2080689606300424
    double_data: 0.415512925497424
    double_data: -0.4823887436442144
    double_data: 0.051801958420361206
    double_data: 0.21825876600306313
    double_data: -0.10162425093992675
    double_data: -0.16257735292837472
    double_data: -0.2840318107443786
    double_data: 0.1518140272644065
    double_data: 0.16054556840389672
    double_data: 0.2745428333034262
    double_data: 0.3184705600800125
    double_data: -0.5049795733055599
    double_data: -0.0700613059790607
    double_data: 0.07930321895514168
    double_data: -0.07438468529274644
    double_data: -0.13269230252801306
    double_data: -0.1909800972404857
    double_data: 0.007978034185359284
    double_data: -0.12007967997366531
    double_data: 0.2551193507022327
    double_data: 0.23973741780484442
    double_data: -0.31455744473443487
    double_data: 0.10380081071964943
    double_data: 0.049738695378054705
    double_data: -0.05399875823697407
    double_data: -0.013756284829920007
    double_data: -0.12712468208853844
    double_data: -0.1938501439332109
    double_data: -0.23299615697477902
    double_data: -0.14386442287116963
    double_data: 0.3243719380230003
    double_data: -0.30465669336091133
    double_data: 0.27024969549042627
    double_data: 0.19899953039790927
    double_data: 0.01097511893267005
    double_data: 0.06060235523809048
    double_data: -0.06027921354386913
    double_data: -0.17204359589279053
    double_data: -0.11434417642647053
    double_data: -0.21869476981675276
    double_data: 0.34081143779081896
    double_data: -0.07792250737236249
    double_data: 0.21228801355543403
    double_data: 0.21710617834080295
    double_data: -0.024250355489535157
    double_data: -0.16674617540875286
    double_data: -0.05171825659941942
    double_data: -0.17142772284628946
    double_data: -0.18121130131596058
    double_data: -0.23241166353923928
    double_data: 0.34406857673412533
    double_data: 0.06713051317813513
    double_data: 0.28377981165728416
    double_data: 0.07838464297667198
    double_data: 0.00702084067895111
    double_data: -0.03215570406804548
    double_data: -0.057361696226005246
    double_data: -0.1524429657662629
    double_data: -0.11083451478533497
    double_data: -0.16302228119728254
    double_data: -0.09719618252972599
    double_data: -0.008959747505375718
    double_data: 0.3053271442306217
    double_data: 0.19977636707232146
    double_data: 0.029772623856169262
    double_data: 0.05660285717577557
    double_data: 0.0005764342596255384
    double_data: -0.12829160098983286
    double_data: -0.12948818427258793
    double_data: -0.13496512168561875
    double_data: -0.13407496070796077
    double_data: 0.01723529245437865
    double_data: 0.13242405860645537
    double_data: 0.28573045128567376
    double_data: -0.007268443901120174
    double_data: 0.13215613100104237
    double_data: -0.02560001567442216
    double_data: -0.04000747907841672
    double_data: -0.07801562841561026
    double_data: -0.17693271843953057
    double_data: -0.05393809489820807
    double_data: 0.07361404447554656
    double_data: -0.03940046926907073
    double_data: 0.338510932283995
    double_data: 0.025249811359248062
    double_data: 0.11357665193034265
    double_data: -0.07389462900812052
    double_data: -0.020954218632365545
    double_data: -0.09453996627348756
    double_data: -0.0006993909261251959
    double_data: -0.017422397883629138
    double_data: 0.006657678028254291
    double_data: -0.048907158669224765
    double_data: 0.1474331447460919
    double_data: 0.06105586305502688
    double_data: 0.046640808442514
    double_data: 0.01688301827450335
    double_data: -0.009358077236246235
    double_data: -0.036402017416834125
    double_data: -0.0017909964125379534
    double_data: -0.047732804307631826
    double_data: -0.007108735533636292
    double_data: 0.12268335350266174
    double_data: -0.1430614032805784
    double_data: 0.055221085099580396
    double_data: -0.0012058978890548307
    double_data: 0.02834896957201896
    double_data: -0.009051306565818767
    double_data: -0.03012866799219352
    double_data: -0.015414553595042343
    double_data: -0.03959892022399373
    double_data: -0.01450054722906724
    double_data: 0.012612224798613387
    double_data: 0.02965564036440568
    double_data: -0.030192153606220257
    double_data: -0.04092460824321797
    double_data: -0.06403808591574771
    double_data: -0.01614859521665841
    double_data: 0.011402409919109542
    double_data: -0.03758041380667572
    double_data: -0.013554683481970645
    double_data: -0.017507260511189178
    double_data: 0.023928181385470676
    double_data: 0.022976872366345436
    double_data: 0.050816580159070424
    double_data: 0.01752145829707591
    double_data: -9.470795074604949e-05
    double_data: 0.01592026395034327
    double_data: 0.06264458730148309
    double_data: -0.03586344534492833
    double_data: 0.004790768246985774
    double_data: -0.04116631745416564
    double_data: 0.004400512990605151
    double_data: 0.027676777375584844
    double_data: -0.04695328137164258
    double_data: -0.022207546344925885
    double_data: 0.01093374218902767
    double_data: -0.01679112780774626
    double_data: -0.001563968822437637
    double_data: -0.0025851311176037523
    double_data: -0.04395720570742005
    double_data: -0.04937388228172835
    double_data: 0.0222662881358542
    double_data: 0.019772559813328743
    double_data: 0.0014886581951650073
    double_data: -0.03536792448345822
    double_data: -0.0055851238353667575
    double_data: 0.006758400602381299
    double_data: 0.05957976363551046
    double_data: -0.016994247261085827
    double_data: -0.009013469672205697
    double_data: -0.04680062657189721
    double_data: -0.004820475468517206
    double_data: 0.01623193760260129
    double_data: 0.0024340505610899016
    double_data: -0.001802038280885883
    double_data: -0.030397025805270605
    double_data: -0.0062153570357547415
    double_data: -0.014128607806179763
    double_data: 0.0245940920433749
    double_data: 0.07717614398501
    double_data: -0.020423099515584332
    double_data: 0.02098899225441992
    double_data: 0.016110976065137596
    double_data: 0.007140258275109757
    double_data: 0.025939064885188233
    double_data: 0.059767414318293285
    double_data: 0.009201342079848145
    double_data: -0.030561272977368784
    double_data: -0.04571692153233903
    double_data: 0.036119993896149304
    double_data: 0.02848699665780546
    double_data: -0.08007514030538268
    double_data: 0.029509181117244803
    double_data: 0.014330018128977915
    double_data: -0.042084580527749306
    double_data: -0.009159615762105972
    double_data: -0.1690698723836216
    double_data: 0.07604243574173032
    double_data: -0.004929511064013154
    double_data: 0.24553050090693113
    double_data: 0.0013623161793741801
    double_data: -0.2621077346540118
    double_data: 0.049537617948284755
    double_data: -0.014274957240923177
    double_data: -0.09029504805468166
    double_data: 0.057415732732899245
    double_data: -0.16119710137734705
    double_data: 0.04028417448974934
    double_data: 0.21590104019776926
    double_data: 0.2992456531629008
    double_data: -0.07817631854090917
    double_data: -0.23282891642194117
    double_data: 0.03693321327648443
    double_data: -0.02223646594052987
    double_data: -0.1042653284150771
    double_data: -0.0528911259814615
    double_data: 0.01658453955650182
    double_data: -0.02503235315854272
    double_data: 0.1270097063546675
    double_data: 0.32040259356105427
    double_data: -0.0599608302141207
    double_data: -0.11262541843587377
    double_data: -0.021711249249777867
    double_data: -0.09110437421373675
    double_data: -0.07215121429996642
    double_data: -0.07684842939368897
    double_data: -0.017726685598326523
    double_data: -0.058102886443691285
    double_data: 0.2124240424435261
    double_data: 0.4943881172620714
    double_data: -0.19409268854377829
    double_data: -0.3296811399127951
    double_data: 0.15141253093077725
    double_data: -0.1486268463140404
    double_data: 0.07261420304528832
    double_data: -0.05884772717967645
    double_data: 0.18539908938504626
    double_data: -0.04644601785195189
    double_data: 0.47436025309759006
    double_data: 0.35617980599731375
    double_data: -0.37337804934644675
    double_data: -0.2289012657118101
    double_data: 0.01090392820780338
    double_data: -0.2284535001826654
    double_data: 0.16564109246555633
    double_data: -0.16857651138485139
    double_data: 0.18084803030930946
    double_data: -0.11406492978819552
    double_data: 0.30718857102245656
    double_data: 0.5011770365983268
    double_data: -0.4831627512621595
    double_data: -0.07695310668617322
    double_data: 0.029430828879075797
    double_data: -0.32452561598787977
    double_data: 0.15852703858353118
    double_data: -0.22155869590913277
    double_data: 0.16461298087224444
    double_data: -0.31927294866078537
    double_data: 0.3965102141040883
    double_data: 0.575562005397527
    double_data: -0.4719212113344288
    double_data: 0.19350749352416674
    double_data: -0.08442239575969365
    double_data: -0.4266817421277811
    double_data: 0.21548415727080097
    double_data: -0.33695184816712137
    double_data: 0.008718066204455888
    double_data: -0.16847056764938478
    double_data: 0.4264162035931685
    double_data: 0.4153328844687531
    double_data: -0.35430718384022786
    double_data: 0.0124749383367867
    double_data: -0.13348400061673973
    double_data: -0.2995963109769166
    double_data: 0.41607050788267563
    double_data: -0.31037748167736257
    double_data: 0.04788519514158855
    double_data: 0.2524404457791752
    double_data: 0.1982000725191257
    double_data: 0.4899840253792305
    double_data: -0.15041979705610717
    double_data: -0.21565943433892987
    double_data: -0.019144038818907652
    double_data: -0.31736471742575767
    double_data: 0.16148103803300518
    double_data: -0.31778313865030866
    double_data: -0.06339468152677999
    double_data: 0.17418142850006815
    double_data: 0.4315308140963907
    double_data: 0.28689872189235355
    double_data: -0.30991518894266096
    double_data: 0.031727852592188736
    double_data: -0.07128907512003779
    double_data: -0.33828755448270564
    double_data: 0.4260362891199383
    double_data: -0.3879865948182698
    double_data: 0.15756937221738074
    double_data: -0.03834754997058499
    double_data: 0.18190971224825803
    double_data: 0.31355372659414615
    double_data: -0.4492695792943369
    double_data: 0.4235000302245908
    double_data: -0.13904178274626672
    double_data: -0.37687806775862254
    double_data: 0.3496344417958261
    double_data: -0.45790552385744465
    double_data: -0.12592646546906575
    double_data: 0.023226717431418815
    double_data: 0.1386665190848038
    double_data: 0.44351008081106064
    double_data: -0.22091367216399363
    double_data: 0.1226865786520781
    double_data: 0.05548143894145279
    double_data: -0.36519956037857154
    double_data: 0.27199591417893915
