ir_version: 3
producer_name: "onnx-tensorflow"
graph {
  node {
    input: "Placeholder"
    output: "Cast"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 11
      type: INT
    }
  }
  node {
    input: "h1/weights"
    output: "h1/weights/read"
    name: "h1/weights/read"
    op_type: "Identity"
  }
  node {
    input: "Cast"
    input: "h1/weights/read"
    output: "h1/MatMul"
    name: "h1/MatMul"
    op_type: "MatMul"
  }
  node {
    input: "h1/biases"
    output: "h1/biases/read"
    name: "h1/biases/read"
    op_type: "Identity"
  }
  node {
    input: "h1/MatMul"
    input: "h1/biases/read"
    output: "h1/add"
    name: "h1/add"
    op_type: "Add"
    attribute {
      name: "broadcast"
      i: 1
      type: INT
    }
  }
  node {
    input: "h1/add"
    output: "h1/Relu"
    name: "h1/Relu"
    op_type: "Relu"
  }
  node {
    input: "h2/weights"
    output: "h2/weights/read"
    name: "h2/weights/read"
    op_type: "Identity"
  }
  node {
    input: "h1/Relu"
    input: "h2/weights/read"
    output: "h2/MatMul"
    name: "h2/MatMul"
    op_type: "MatMul"
  }
  node {
    input: "h2/biases"
    output: "h2/biases/read"
    name: "h2/biases/read"
    op_type: "Identity"
  }
  node {
    input: "h2/MatMul"
    input: "h2/biases/read"
    output: "h2/add"
    name: "h2/add"
    op_type: "Add"
    attribute {
      name: "broadcast"
      i: 1
      type: INT
    }
  }
  node {
    input: "h2/add"
    output: "h2/Relu"
    name: "h2/Relu"
    op_type: "Relu"
  }
  node {
    input: "h3/weights"
    output: "h3/weights/read"
    name: "h3/weights/read"
    op_type: "Identity"
  }
  node {
    input: "h2/Relu"
    input: "h3/weights/read"
    output: "h3/MatMul"
    name: "h3/MatMul"
    op_type: "MatMul"
  }
  node {
    input: "h3/biases"
    output: "h3/biases/read"
    name: "h3/biases/read"
    op_type: "Identity"
  }
  node {
    input: "h3/MatMul"
    input: "h3/biases/read"
    output: "h3/add"
    name: "h3/add"
    op_type: "Add"
    attribute {
      name: "broadcast"
      i: 1
      type: INT
    }
  }
  node {
    input: "h3/add"
    output: "h3/Relu"
    name: "h3/Relu"
    op_type: "Relu"
  }
  node {
    input: "output/weights"
    output: "output/weights/read"
    name: "output/weights/read"
    op_type: "Identity"
  }
  node {
    input: "h3/Relu"
    input: "output/weights/read"
    output: "output/MatMul"
    name: "output/MatMul"
    op_type: "MatMul"
  }
  node {
    input: "output/biases"
    output: "output/biases/read"
    name: "output/biases/read"
    op_type: "Identity"
  }
  node {
    input: "output/MatMul"
    input: "output/biases/read"
    output: "output/add"
    name: "output/add"
    op_type: "Add"
    attribute {
      name: "broadcast"
      i: 1
      type: INT
    }
  }
  name: "output/add"
  initializer {
    dims: 784
    dims: 64
    data_type: DOUBLE
    name: "h1/weights"
    double_data: 0.006350893421039715
    double_data: -0.048241435831228474
    double_data: -0.01459813311543869
    double_data: -0.05059598138976269
    double_data: -0.04010252279579037
    double_data: -0.03640346446275649
    double_data: 0.004278399347508311
    double_data: -0.05546032224422469
    double_data: 0.006932177343018373
    double_data: -0.008228395892423477
    double_data: -0.03346974267714691
    double_data: -0.017984738387727947
    double_data: 0.024818859729590376
    double_data: -0.06771935359486686
    double_data: -0.00719862134454132
    double_data: -0.04039001533970036
    double_data: -0.005284890606104911
    double_data: -0.02823957371467875
    double_data: 0.009664626059969511
    double_data: 0.03079911466654113
    double_data: -0.00317240112979452
    double_data: 0.006305213470968806
    double_data: -0.04948284395203507
    double_data: -0.03316281592021541
    double_data: -0.024843063232529727
    double_data: -0.004383883736468021
    double_data: -0.04900040698984122
    double_data: 0.044644292070798314
    double_data: 0.06434161443390697
    double_data: 0.011323301366863318
    double_data: -0.030203690820008355
    double_data: -0.009591059179470346
    double_data: -0.00951727480978345
    double_data: 0.0064432814284345885
    double_data: 0.05352909298240418
    double_data: 0.03135503782942003
    double_data: -0.050040574073250334
    double_data: 0.0673926207955682
    double_data: 0.007059479224084659
    double_data: 0.018506728316656097
    double_data: -0.02142561060606728
    double_data: -0.009038499311600551
    double_data: 0.007909480249239077
    double_data: -0.01866842391039167
    double_data: 0.0007961559013058418
    double_data: -0.0435070836462878
    double_data: 0.030916160049679897
    double_data: -0.032974310568339195
    double_data: 0.030534086964190372
    double_data: 0.057939719053197364
    double_data: 0.02170146820863884
    double_data: 0.00656575678752426
    double_data: -0.021430217485217676
    double_data: -0.005089231813100117
    double_data: -0.030279654583646565
    double_data: 0.025406480164638968
    double_data: 0.013662123819119933
    double_data: 0.0003483516002753146
    double_data: 0.02221110577461889
    double_data: 0.04054510435911534
    double_data: 0.023903254444853042
    double_data: -0.035233173647300164
    double_data: 0.05834926131470595
    double_data: -0.008312858806210606
    double_data: -0.02267836620638138
    double_data: 0.03130011060302807
    double_data: 0.022365820135614146
    double_data: 0.004274372794464425
    double_data: 0.026577680033672717
    double_data: -0.01810940465000802
    double_data: -0.013508220246337329
    double_data: 0.003310638007999542
    double_data: 0.04965535421898822
    double_data: 0.015862728806865168
    double_data: 0.00577467975705072
    double_data: 0.009842615542850004
    double_data: -0.004876224724991413
    double_data: -0.019860597872064664
    double_data: 0.001312033935947755
    double_data: -0.03261616330115965
    double_data: 0.01656329879087013
    double_data: -0.03494433811131714
    double_data: -0.03053284389822647
    double_data: -0.03790385083704747
    double_data: -0.04712896326453127
    double_data: -0.008644779140398288
    double_data: -0.0014523960763505959
    double_data: -0.013064164554752972
    double_data: -0.012873940377816835
    double_data: 0.04517589897510102
    double_data: -0.036130182173214426
    double_data: 0.013798041326360505
    double_data: 0.02256575625537588
    double_data: -0.028199100522328973
    double_data: 0.021618666940729572
    double_data: -0.044219624293011274
    double_data: -0.0466431077369574
    double_data: -0.016659006742878697
    double_data: 0.03317036832215836
    double_data: 0.0029564249660323405
    double_data: -0.039324816354721154
    double_data: 0.0035026325962782133
    double_data: -0.05484641122787934
    double_data: -0.026335426254011376
    double_data: 0.0431000199971158
    double_data: 1.0290411298986094e-05
    double_data: -0.014526624789933178
    double_data: 0.04156816925290235
    double_data: 0.032643416993594576
    double_data: -0.02965737190968615
    double_data: 0.018548129961086745
    double_data: -0.02168744386872155
    double_data: -0.004106239020369287
    double_data: -0.042329389950411744
    double_data: 0.03898550178746299
    double_data: -0.031835803854458854
    double_data: -0.038751810923689546
    double_data: -0.02855786499530362
    double_data: 0.03565733199885789
    double_data: -0.004020123946339455
    double_data: -0.0382296888129293
    double_data: 0.031595859116149795
    double_data: -0.03262569516101197
    double_data: 0.0012151975619793937
    double_data: 0.017629839013561906
    double_data: 0.06801195255223251
    double_data: -0.038017373094264735
    double_data: -0.023293496151201448
    double_data: 0.040038046943123067
    double_data: -0.004365577833522187
    double_data: 0.0029058210733244006
    double_data: 0.024424939086932114
    double_data: 0.05835885607611259
    double_data: -0.012017269112528142
    double_data: -0.04261321531615625
    double_data: 0.04931814097160065
    double_data: -0.024941614279037107
    double_data: -0.016896035767134887
    double_data: -0.04929465965345844
    double_data: 0.04019009411462927
    double_data: -0.018634673110028945
    double_data: 0.03244402595342558
    double_data: -0.03618436805048373
    double_data: 0.046551383548528134
    double_data: 0.03547474017215588
    double_data: 0.017599377854611603
    double_data: 0.027204468825810155
    double_data: 0.035688954688733066
    double_data: -0.02813526851680088
    double_data: 0.022201222108092722
    double_data: -0.00021373879463209948
    double_data: 0.05671680535695492
    double_data: 0.0284073657212714
    double_data: -0.013836318371346749
    double_data: 0.010094968318584177
    double_data: 0.050846443106700875
    double_data: 0.04397142611745175
    double_data: 0.010922447830039919
    double_data: 0.0005632686537577616
    double_data: 0.0015462679111089346
    double_data: -0.026817464585452675
    double_data: 0.06031566679010043
    double_data: 0.017508683185584763
    double_data: -0.04880445463307492
    double_data: -0.06555853538968207
    double_data: 0.03099957001605234
    double_data: 0.013394153064534597
    double_data: 0.030469047215591412
    double_data: -0.049823988215994465
    double_data: 0.05039202671952454
    double_data: 0.017285350171800593
    double_data: 0.013324323860552623
    double_data: -0.019840908481777025
    double_data: 0.056728742431224624
    double_data: 0.027865985807126143
    double_data: -0.004592334165913717
    double_data: -0.004329374622114605
    double_data: -0.039724606259528374
    double_data: 0.017570865526261577
    double_data: -0.03949182547492903
    double_data: 0.021156691680108676
    double_data: -0.01765624368566296
    double_data: -0.02062137392683175
    double_data: -0.025012286566546395
    double_data: 0.011190597256312274
    double_data: -0.05489411505798945
    double_data: -0.016970417205436742
    double_data: -0.03872750682582785
    double_data: 0.013707921522293111
    double_data: 0.02315845132076314
    double_data: 0.011530502734977233
    double_data: 0.06059885466037572
    double_data: 0.04482800257521838
    double_data: -0.0021332397733335178
    double_data: 0.007444909183136912
    double_data: -0.0006087669028150048
    double_data: -0.014283058821498764
    double_data: 0.037042213849834714
    double_data: -0.002047792453740488
    double_data: 0.05655694108581355
    double_data: 0.010199148939512475
    double_data: -0.0231436877563148
    double_data: 0.012317109862763978
    double_data: 0.05831885936450025
    double_data: 0.016905882173694035
    double_data: -0.005451803946179968
    double_data: 0.009695880765767582
    double_data: -0.016949044344879382
    double_data: 0.01642235693390544
    double_data: 0.06890031797055242
    double_data: 0.021325834428605014
    double_data: -0.0441361005015618
    double_data: 0.006902219019483884
    double_data: 0.06005662612337004
    double_data: 0.011007119334295878
    double_data: -0.03422512410710758
    double_data: -0.004524532118487676
    double_data: 0.03699197226289063
    double_data: 0.02050520934366646
    double_data: 0.009173985563464397
    double_data: 0.05171390324525267
    double_data: 0.030826334876009436
    double_data: -0.052439622739174865
    double_data: -0.0016558312535610176
    double_data: 0.008712338200707553
    double_data: -0.024784375464070613
    double_data: -0.04523194027776214
    double_data: -0.00662289886700799
    double_data: 0.039349130306563854
    double_data: 0.001960800952961847
    double_data: 0.032379368698272654
    double_data: -0.05679224488707564
    double_data: -0.011059056274012507
    double_data: 0.04323938461079119
    double_data: -0.0518711561065593
    double_data: 0.0021373041366919174
    double_data: 0.04143515314715947
    double_data: -0.01743408979797884
    double_data: -0.01989542135991101
    double_data: 0.04490252707762142
    double_data: 0.06618597783150204
    double_data: -0.03864517915060711
    double_data: -0.011611159930578666
    double_data: 0.05105114866955078
    double_data: 0.00011693756236061039
    double_data: -0.032616240284993936
    double_data: -0.01335501904213013
    double_data: 0.046235724093435376
    double_data: -0.016224319082883493
    double_data: -0.047642374214081504
    double_data: -0.039344803776445524
    double_data: 0.030611372411991182
    double_data: -0.012214890609597469
    double_data: 0.017708349613024685
    double_data: 0.06489579290386802
    double_data: -0.038483584864568564
    double_data: 0.05434543107217317
    double_data: 0.004402055201801742
    double_data: 0.007298846679899681
    double_data: 0.01669546485044517
    double_data: -0.006241237085854505
    double_data: 0.025987474142673057
    double_data: 0.005227179566832495
    double_data: 0.00298251275165773
    double_data: 0.035404245299285826
    double_data: -0.05640687380966043
    double_data: -0.06921046990721616
    double_data: 0.015640961327825775
    double_data: 0.020371324164295695
    double_data: -0.026212209179907
    double_data: -0.011328201269743474
    double_data: 0.06260301843752898
    double_data: 0.03950157911589161
    double_data: -0.00966813757722852
    double_data: 0.05528289318872467
    double_data: -0.025950305686892026
    double_data: 0.00753902569611846
    double_data: 0.06699566128607877
    double_data: 0.052567586532816374
    double_data: -0.04346569079969951
    double_data: -0.012543466997463707
    double_data: 0.028409680306266023
    double_data: -0.01724195661322123
    double_data: -0.04628221266595554
    double_data: -0.017889719589738052
    double_data: 0.05773894979561709
    double_data: 0.032078561828882655
    double_data: -0.02821558668359217
    double_data: 0.002511417524861875
    double_data: 0.03835172083719498
    double_data: -0.06545510302425261
    double_data: -0.05248446674781335
    double_data: 0.05907478449199731
    double_data: 0.023129758237904034
    double_data: -0.018687075681460646
    double_data: -0.04425721361837148
    double_data: 0.0068983990631285306
    double_data: -0.05882614039668014
    double_data: 0.03070620635434092
    double_data: -0.029329137984799178
    double_data: -0.01390658618026071
    double_data: 0.027430739589678205
    double_data: -0.010321611191811186
    double_data: 0.005927717474802921
    double_data: -0.038396356637523194
    double_data: 0.04408673521589548
    double_data: 0.03267588514119132
    double_data: -0.03407354666716701
    double_data: 0.026216867042875323
    double_data: 0.02676863888933484
    double_data: -0.017863388201059982
    double_data: -0.01456746169417803
    double_data: 0.0009219474925833624
    double_data: -0.0009570220402860998
    double_data: -0.005224290332541093
    double_data: 0.03345729647203501
    double_data: -0.02756439075276896
    double_data: -0.065776749857102
    double_data: -0.038748118457244296
    double_data: -0.024089956030127216
    double_data: 0.002213528153654193
    double_data: -0.022541534719980327
    double_data: 0.02676427827120203
    double_data: 0.04807763219759806
    double_data: -0.009239425791861976
    double_data: 0.034326048823342434
    double_data: 0.05348532408541804
    double_data: 0.03818981866568635
    double_data: -0.005365812166438551
    double_data: -0.003858534243518665
    double_data: 0.008471228032235654
    double_data: 0.029482239708704686
    double_data: -0.00028509700510310744
    double_data: 0.022499449025906077
    double_data: -0.022455216104905976
    double_data: -0.03273283003012375
    double_data: 0.014527406393133787
    double_data: -0.01653362838857042
    double_data: 0.03357354422916643
    double_data: 0.03400830446471402
    double_data: -0.029755995100347248
    double_data: -0.014462295070007916
    double_data: 0.007211554861879292
    double_data: -5.531506301645763e-05
    double_data: -0.020042997190362236
    double_data: 0.0026737398764534945
    double_data: 0.01657326109149536
    double_data: 0.04462889248647651
    double_data: 0.004597442638805394
    double_data: 0.020219042236713353
    double_data: -0.061864278609325835
    double_data: -0.02777048218708747
    double_data: -0.06680434547211221
    double_data: 0.058392511609021126
    double_data: -0.05228943144416683
    double_data: 0.024431156586029523
    double_data: 0.013558640307261977
    double_data: 0.008516647001754175
    double_data: 0.05060021977342034
    double_data: 0.022312537102164586
    double_data: 0.05585591855333681
    double_data: -0.0012397232565536625
    double_data: -0.03802176713090832
    double_data: 0.0026584768247510334
    double_data: 0.05899944780258495
    double_data: 0.029579762479115885
    double_data: 0.028417761242346483
    double_data: -0.02662265876230689
    double_data: -0.04088079795786519
    double_data: 0.04736435066007948
    double_data: -0.034405986166522955
    double_data: -0.04449280010760103
    double_data: -0.0029637340096314727
    double_data: 0.0055166209780139796
    double_data: 0.0062027844268206555
    double_data: 0.016797587830954502
    double_data: 0.049284332175375666
    double_data: -0.0038659669281585433
    double_data: -0.00585373327422858
    double_data: 0.02596168908100834
    double_data: 0.010801189034492287
    double_data: -0.04015274726378083
    double_data: -0.0048911011423099825
    double_data: 0.0694289164957992
    double_data: 0.0413477697303967
    double_data: -0.02582829946141319
    double_data: -0.028113686440881764
    double_data: 0.05299834486743062
    double_data: -0.05083934451932418
    double_data: 0.03208945722894826
    double_data: -0.02321752193306086
    double_data: 0.04880105824068641
    double_data: -0.030634138290860757
    double_data: 0.025736882292534347
    double_data: 0.0452777418881265
    double_data: -0.030874364402139177
    double_data: 0.029532350800785683
    double_data: 0.01912776337560788
    double_data: -0.0035143425181866014
    double_data: -0.010028802475616766
    double_data: 0.013846635213985966
    double_data: -0.050662585754714023
    double_data: -0.030543944860517223
    double_data: 0.05700871954276232
    double_data: 0.05892336049986924
    double_data: 0.021432206029230502
    double_data: 0.01854887122372799
    double_data: 0.010594731326375256
    double_data: 0.03022242488828045
    double_data: -0.006078572002966635
    double_data: 0.04574139630771848
    double_data: -0.04081826756339671
    double_data: -0.0083616118613803
    double_data: 0.045968309676728415
    double_data: 0.014433244633642687
    double_data: -0.03654508247223227
    double_data: 0.0368573632851882
    double_data: -0.008895946951822102
    double_data: 0.04966243026912924
    double_data: 0.02514092877050696
    double_data: -0.0194976526285095
    double_data: -0.009547561136134886
    double_data: -0.03221396741413505
    double_data: 0.0552695605265258
    double_data: 0.0519007210343109
    double_data: -0.06060356655725954
    double_data: 0.007468604697893188
    double_data: -0.027615539739826396
    double_data: 0.01924322510274998
    double_data: 0.05328408260151866
    double_data: -0.01641789226395134
    double_data: 0.01701193495718906
    double_data: -0.021006491366941122
    double_data: -0.027562381198996566
    double_data: 0.0019039872164620605
    double_data: 0.01369218920942521
    double_data: 0.0034449691170300965
    double_data: -0.02519140841976937
    double_data: 0.01442900491757919
    double_data: 0.012784496588251032
    double_data: 0.0018464850205829686
    double_data: 0.014488099166518813
    double_data: 0.049062598026038594
    double_data: 0.037110803164341837
    double_data: -0.0065655865957293755
    double_data: -0.06428098982636066
    double_data: 0.02339109098667111
    double_data: -0.006703399232297566
    double_data: 0.010809003222192788
    double_data: -0.004753736637992576
    double_data: -0.01846752111693585
    double_data: -0.00011226934916841072
    double_data: -0.06868718036213883
    double_data: 0.040646630182063055
    double_data: 0.04566492682989346
    double_data: -0.018001064701807876
    double_data: 0.007651971252740379
    double_data: -0.022309964185814653
    double_data: 0.051257987555578054
    double_data: 0.007021119960023985
    double_data: 0.029131614574367675
    double_data: 0.0009996150299529064
    double_data: -0.03692845631306951
    double_data: -0.013024638069162962
    double_data: -0.012876121676869403
    double_data: -0.0341970166629674
    double_data: 0.005861176303891496
    double_data: -0.017369382035546353
    double_data: 0.052519734171828224
    double_data: -0.013157557853666301
    double_data: -0.004258328441960373
    double_data: -0.0028230224266362056
    double_data: 0.0010647112522783717
    double_data: 0.012076908418625706
    double_data: 0.0576169617534921
    double_data: 0.025395048554925123
    double_data: 0.022729019295585774
    double_data: -0.03479590109096286
    double_data: 0.039573635698167235
    double_data: 0.05354485538008605
    double_data: 0.05123984256730076
    double_data: 0.04471780700537722
    double_data: 0.02138873953538908
    double_data: 0.04627152588500578
    double_data: -0.04105880298546446
    double_data: -0.036937122444757976
    double_data: -0.030061638213884787
    double_data: 0.0057490821495860015
    double_data: -0.026105083802852348
    double_data: 0.004087458997265552
    double_data: -0.011590967522961505
    double_data: 0.005425679011740092
    double_data: -0.008144807009596203
    double_data: -0.061572092435479675
    double_data: 0.018760858354492916
    double_data: -0.0369523511600603
    double_data: -0.008919123976964953
    double_data: 0.056804809843380044
    double_data: -0.023265363867571685
    double_data: -0.00030609801183297913
    double_data: -0.022624207271562356
    double_data: 0.03467559416731303
    double_data: 0.022971688125331877
    double_data: -0.0012291746736249264
    double_data: 0.005016493943032008
    double_data: -0.02325867005850014
    double_data: -0.012549977421377189
    double_data: 0.02627198947364947
    double_data: -0.053707540668321396
    double_data: -0.059866659465558025
    double_data: -0.031847592603942536
    double_data: 0.00952035831390641
    double_data: 0.0034746226190025425
    double_data: -0.025459318596065986
    double_data: -0.04480381277491744
    double_data: 0.0038835282281857366
    double_data: 0.013111273830131796
    double_data: 0.028391914033363067
    double_data: 0.04629087777212662
    double_data: -0.0025286553097633433
    double_data: 0.048545778007906756
    double_data: 0.005268104379574633
    double_data: 0.041362227839698666
    double_data: -0.025970494569991967
    double_data: 0.01808262703142858
    double_data: 0.039133884588941036
    double_data: 0.002284682467365049
    double_data: -0.012749671110440286
    double_data: -0.03559055204449957
    double_data: 0.02446400660574871
    double_data: 0.010411336147080332
    double_data: 0.007417534593162808
    double_data: 0.029364003311001557
    double_data: 0.009260458261642958
    double_data: 0.01194996044327638
    double_data: -0.043764361429563046
    double_data: 0.012654089983531737
    double_data: -0.00783332119991742
    double_data: 0.04991400269563201
    double_data: 0.018935894243575224
    double_data: 0.0018059908690793332
    double_data: 0.027940451459333937
    double_data: 0.06368225821536354
    double_data: -0.01192350789072279
    double_data: -0.007330372915318171
    double_data: 0.03929913356107222
    double_data: 0.011370430308838777
    double_data: 0.04206401300418861
    double_data: 0.014712673590238813
    double_data: 0.021347725089462838
    double_data: 0.036772079947039876
    double_data: -0.046966118815770765
    double_data: 0.0038019891952565396
    double_data: -0.034841127694466914
    double_data: -0.006949832368775702
    double_data: 0.05079981277492403
    double_data: 0.02073232464484134
    double_data: 0.038039823676847134
    double_data: -0.005483928425540172
    double_data: -0.03321344895031133
    double_data: -0.00538669922264954
    double_data: -0.032798112756191454
    double_data: 0.016736191328345876
    double_data: -0.0026708476185597226
    double_data: -0.013075005173122684
    double_data: 0.033947171975780545
    double_data: 0.07043982266657503
    double_data: -0.01213515972444519
    double_data: 0.011924461295884137
    double_data: 0.01609353839866043
    double_data: -0.012604764601948776
    double_data: 0.02683723645835722
    double_data: 0.055612312045202845
    double_data: 0.006060282310669738
    double_data: -0.0015153761762753013
    double_data: -0.03579555167927719
    double_data: 0.025286487035780028
    double_data: -0.00811914865126059
    double_data: -0.01241884421382924
    double_data: 0.05121666948070784
    double_data: -0.03124128198431799
    double_data: -0.031252602912639246
    double_data: -0.05642755068432916
    double_data: 0.04221679025918271
    double_data: -0.006721109435972671
    double_data: -0.015851098031936656
    double_data: -0.004186478218064495
    double_data: 0.05555983350033679
    double_data: -0.04454905410125867
    double_data: 0.018028299720880988
    double_data: 0.03412083919403196
    double_data: 0.0040830575106755055
    double_data: 0.010275793686798585
    double_data: -0.016130250370979857
    double_data: 0.015799828629357852
    double_data: -0.06451560540752231
    double_data: -0.03982331346482917
    double_data: 0.035007110201855964
    double_data: 0.02153370031247928
    double_data: 0.026854365469413118
    double_data: 0.04189222627986634
    double_data: 0.030003655139833094
    double_data: 0.03657687652871751
    double_data: -0.018712354680093173
    double_data: -0.04143211845455755
    double_data: 0.012808626052947492
    double_data: -0.051545678232317926
    double_data: 0.026955553125933847
    double_data: 0.0030687221254812346
    double_data: -0.008731693075196102
    double_data: -0.022858777771946462
    double_data: -0.0007921793215704483
    double_data: -0.009265624198942073
    double_data: 0.005966389049307049
    double_data: 0.06777734670295564
    double_data: -0.009682762831419904
    double_data: -0.02973494164187946
    double_data: -0.04428483470545886
    double_data: -0.011371424039431118
    double_data: 0.027996512331186583
    double_data: -0.008605078320759628
    double_data: -0.001895408223661905
    double_data: -0.04874390133899865
    double_data: 0.02754392652587335
    double_data: -0.023732322809259885
    double_data: -0.026708365551653894
    double_data: -0.004445632496217487
    double_data: -0.001751994535616893
    double_data: -0.0594655494409879
    double_data: 0.03795813104638174
    double_data: -0.023223825354986637
    double_data: 0.01575203991238704
    double_data: -0.028188263262048853
    double_data: 0.054022129599033325
    double_data: -0.018826902602200192
    double_data: 0.04067374518793346
    double_data: -0.03585095762958192
    double_data: 0.02964918499687318
    double_data: -0.004785255592583621
    double_data: -0.008644714242993632
    double_data: -0.0045550850548589684
    double_data: -0.005657285750753986
    double_data: 0.05921388641546552
    double_data: -0.024532149625100044
    double_data: -0.03795813806321442
    double_data: 0.0005412395234821051
    double_data: 0.020528494590895938
    double_data: -0.004336509266927176
    double_data: -0.014402121330256389
    double_data: -0.018355172149339197
    double_data: -0.05972817410448291
    double_data: -0.04739420059305419
    double_data: -0.03538635022868649
    double_data: -0.06926767654532502
    double_data: -0.027659180469055904
    double_data: -0.004912016465152534
    double_data: -0.03254849049862727
    double_data: 0.024169219192397888
    double_data: 0.02775096176028463
    double_data: 0.003423588810932938
    double_data: -0.019523553036203633
    double_data: -0.013557325375229256
    double_data: 0.01721027985258698
    double_data: -0.025747822759706857
    double_data: -0.004530181390292332
    double_data: 0.043257283932279476
    double_data: -0.05249970854262016
    double_data: 0.05390172741401028
    double_data: -0.05801920918984607
    double_data: 0.010517776645469743
    double_data: 0.012247080549745078
    double_data: 0.05478920620015834
    double_data: -0.03088333013832122
    double_data: 0.01573314799714824
    double_data: -0.027547391972703214
    double_data: 0.0012847651533977298
    double_data: -0.011677958529185939
    double_data: 0.06425628439741184
    double_data: -0.017195402856828145
    double_data: -0.022804789575095425
    double_data: 0.04955941669058647
    double_data: 0.03900655381049697
    double_data: -0.03450861144581315
    double_data: -0.007781278259135292
    double_data: 0.0027606635761950648
    double_data: 0.006012714829438438
    double_data: 0.01687245190563001
    double_data: 0.011411799596230024
    double_data: -0.02319345650049323
    double_data: -0.05402336975795693
    double_data: -0.028307507746686254
    double_data: -0.016701398348915323
    double_data: 0.041980729474819935
    double_data: -0.0007858833606775527
    double_data: 0.027045890083309525
    double_data: -0.009285960507965254
    double_data: 0.008271000186164786
    double_data: 0.035800373880634305
    double_data: 0.003308629643295335
    double_data: 0.012949194743500068
    double_data: 0.05093301446814128
    double_data: -0.021714634836776502
    double_data: 0.01720514135216672
    double_data: -0.015297254586634942
    double_data: 0.015026463201860312
    double_data: 0.03837746919578339
    double_data: 0.00922291195999902
    double_data: 0.011586272377609817
    double_data: 0.03487033315731797
    double_data: -0.0348422768526472
    double_data: -0.017460906602929416
    double_data: -0.01803387572411654
    double_data: -3.0170826944396485e-05
    double_data: 0.017758910077204402
    double_data: -0.06860088644992549
    double_data: -0.007252978275808685
    double_data: -0.03596155975552295
    double_data: 0.054405112091529914
    double_data: 0.010339419090945394
    double_data: 0.027601464797589216
    double_data: 0.044744756703059725
    double_data: -0.0005364047795827642
    double_data: -0.04085738022742997
    double_data: 0.032755791498164336
    double_data: 0.03598176574375707
    double_data: -0.047077436942553064
    double_data: -0.05817119865295954
    double_data: -0.023927511720301126
    double_data: 0.014314765025485992
    double_data: 0.0045797952611696755
    double_data: 0.052663308645895426
    double_data: 0.0535228531732172
    double_data: -0.02354663258992109
    double_data: 0.017681905112946452
    double_data: -0.0012692414227274702
    double_data: 0.007535761415505295
    double_data: 0.03354513407363368
    double_data: 0.06197004054310836
    double_data: 0.013382399411859147
    double_data: 0.05204042159984538
    double_data: 0.008210683729475018
    double_data: 0.009872553148812581
    double_data: 0.05943025965782869
    double_data: 0.045302732848265144
    double_data: -0.029215695266786957
    double_data: -0.0053877931769251465
    double_data: 0.011441618741806922
    double_data: 0.02206542563833433
    double_data: 0.06544021177563941
    double_data: 0.013427766341096487
    double_data: 0.0015120844221781235
    double_data: 0.005447185052738018
    double_data: -0.025118084537356603
    double_data: -0.027369241090620625
    double_data: -0.04735946000354372
    double_data: 0.020997709896240366
    double_data: 0.02207637775263311
    double_data: -0.012176232592907487
    double_data: -0.046173009671263504
    double_data: 0.03811704546896188
    double_data: -0.028607434493642572
    double_data: 0.0421899894415264
    double_data: -0.031317306092927606
    double_data: 0.04047613041753319
    double_data: 0.041207693207872605
    double_data: -0.03634303089148331
    double_data: -0.018528027795095693
    double_data: 0.007732275211991751
    double_data: 0.02576843061891691
    double_data: -0.06808485179084706
    double_data: -0.012491876592804372
    double_data: -0.005152955171244658
    double_data: 0.03906924297920568
    double_data: 0.005401999099233323
    double_data: -0.05222141924253818
    double_data: -0.04617180287373326
    double_data: -0.0295446406308274
    double_data: -0.013314050282779266
    double_data: 0.04018652900158069
    double_data: -0.02247637356259971
    double_data: 0.008680148909154285
    double_data: -0.033557398840138225
    double_data: 0.01415560416750269
    double_data: -0.041983404516627
    double_data: -0.06969239754311829
    double_data: -0.0708123917565384
    double_data: 0.006073666099902281
    double_data: 0.005172971706689941
    double_data: -0.04303151770410322
    double_data: 0.00936299833205294
    double_data: 0.016626984100127067
    double_data: -0.05236022800107406
    double_data: 0.010449221734283127
    double_data: 0.01114253986780131
    double_data: 0.02439761877735262
    double_data: 0.05630767037097518
    double_data: 0.00176064611613783
    double_data: 0.006821999153547653
    double_data: 0.0087536783516564
    double_data: -0.06299835554718941
    double_data: 0.017482084852041873
    double_data: 0.04003827186100007
    double_data: 0.013835262090354475
    double_data: -0.004862685479412253
    double_data: 0.015093740695955059
    double_data: -0.0040804110078680395
    double_data: -0.050885576664491
    double_data: -0.054035982025069686
    double_data: 7.319436914594275e-05
    double_data: 0.029307260963879502
    double_data: 0.04154385826433241
    double_data: 0.004638877433333773
    double_data: -0.01675183873138205
    double_data: -0.05408755318527879
    double_data: -0.06853017634787162
    double_data: 0.029929598606031543
    double_data: -0.0040684734079025515
    double_data: 0.0003519216737271815
    double_data: 0.02431377043177567
    double_data: -0.021734993371855655
    double_data: -0.022282245216377138
    double_data: -0.02355730396214477
    double_data: 0.049197691941581446
    double_data: 0.029637353353845673
    double_data: -0.038310606632146985
    double_data: 0.009556335728297442
    double_data: -0.02237283929608113
    double_data: 0.043639682017696885
    double_data: -2.2379868826035442e-05
    double_data: 0.05029988874048169
    double_data: 0.0033395547121670126
    double_data: 0.002773861037414205
    double_data: -0.00783002115145207
    double_data: -0.020484729259366386
    double_data: 0.04087613485867963
    double_data: -0.04139513395020238
    double_data: 0.00793511326530382
    double_data: 0.02328126091500724
    double_data: 0.04323421546999123
    double_data: 0.04608840173793893
    double_data: -0.06195842978776851
    double_data: -0.036276646836797675
    double_data: 0.013891775238012343
    double_data: 0.017695746411606324
    double_data: -0.03620426114732291
    double_data: 0.016967686009171243
    double_data: 0.027507599458549605
    double_data: -0.052458930908410174
    double_data: 0.025646654935925495
    double_data: -0.009791112754349325
    double_data: -0.029559782078832683
    double_data: -0.014212309996677788
    double_data: 0.012300533937833338
    double_data: 0.02717550656402586
    double_data: -0.014571658130776472
    double_data: 0.01802779291326483
    double_data: 0.006687167921775024
    double_data: 0.05801841910721531
    double_data: 0.012814144928717727
    double_data: 0.03020176895949726
    double_data: -0.048246382700666175
    double_data: -0.028257177924709765
    double_data: 0.015167108265061433
    double_data: 0.02242466136290559
    double_data: -0.060817217479764644
    double_data: -0.066394385183677
    double_data: 0.010515412115957882
    double_data: -0.002462375040491334
    double_data: 0.04453184297304892
    double_data: -0.009396082812550086
    double_data: 0.002177750992300949
    double_data: 0.025721449479289844
    double_data: 0.015662953041523348
    double_data: 0.04532098886373472
    double_data: -0.01615092418372986
    double_data: -0.012060082656332051
    double_data: 0.02484912867214947
    double_data: -0.0010931010829862637
    double_data: -0.03604961571186613
    double_data: 0.018526550118826243
    double_data: -0.023763197119212855
    double_data: -0.02131091163751766
    double_data: -0.03157255444029555
    double_data: -0.02186618619071613
    double_data: 0.02040500089627316
    double_data: 0.040141245754362447
    double_data: 0.020368364766812506
    double_data: 0.00970745662602149
    double_data: -0.06294598555715102
    double_data: -0.02583373463874389
    double_data: 0.004657490581393259
    double_data: -0.04797456738019403
    double_data: -0.0024165320097265255
    double_data: -0.06443825331548511
    double_data: -0.03359429502764605
    double_data: -0.04832297482437452
    double_data: 0.02844249517450495
    double_data: 0.014799244654526287
    double_data: 0.018626706635726964
    double_data: 0.050060547795723366
    double_data: 0.04721472463943639
    double_data: -0.005695306359736394
    double_data: 0.04418830287323428
    double_data: 0.00024966795527890136
    double_data: 0.05705007107931706
    double_data: -0.054240450269430224
    double_data: 0.06209957801107827
    double_data: -0.0003527756543886928
    double_data: -0.061509505164237796
    double_data: 0.04020329018145344
    double_data: -0.0007988432933640853
    double_data: 0.009135467931401032
    double_data: 0.0027871228338734308
    double_data: -0.02345149092922179
    double_data: -0.023655592614099337
    double_data: -0.06437847025100146
    double_data: 0.0042289547681903916
    double_data: 0.008166596557999515
    double_data: 0.03476899061235917
    double_data: -0.008187201404762454
    double_data: 0.03209971391886672
    double_data: -0.023572788051774422
    double_data: 0.018822250084717895
    double_data: -0.06568556894411097
    double_data: 0.05604296972279014
    double_data: -0.0091091612306978
    double_data: 0.01562056104251883
    double_data: -0.04322503600326167
    double_data: 0.026851374317212132
    double_data: -0.004619151354894319
    double_data: 0.007241930976527417
    double_data: -0.041115515548383656
    double_data: -0.030134132549068954
    double_data: -0.025181974442130946
    double_data: 0.05710223903885628
    double_data: -0.05889179856995053
    double_data: 0.007711684412870558
    double_data: 0.016014080991865503
    double_data: 0.022537323117918742
    double_data: -0.030202217242609995
    double_data: -0.032439010075446646
    double_data: -0.0077267739600453455
    double_data: -0.029699773019482054
    double_data: -0.0238984706351405
    double_data: 0.03128987132319184
    double_data: 0.045486631836529776
    double_data: 0.0007777325495296164
    double_data: 0.02164808426856212
    double_data: 0.05876200726961435
    double_data: -0.010641082728541494
    double_data: -0.03980323961040373
    double_data: 0.007307446371064856
    double_data: 0.03636136980484944
    double_data: -0.04580463154064389
    double_data: -0.007426078485890581
    double_data: -0.007987427161082935
    double_data: -0.019640331209838505
    double_data: 0.006815237332779577
    double_data: -0.03449360405597093
    double_data: -0.06226194693033121
    double_data: -0.02102162017854448
    double_data: 0.013606847122543692
    double_data: -0.01416779838584913
    double_data: -0.028878521500502782
    double_data: -0.03165564485124189
    double_data: -0.05091444544081899
    double_data: 0.0009974004346137088
    double_data: 0.015984514834503423
    double_data: -0.04840462124427736
    double_data: -0.027759488495221255
    double_data: -0.01712796164939486
    double_data: 0.03941863446375056
    double_data: -0.017300977647121154
    double_data: -0.05972756686485552
    double_data: 0.025694707624607408
    double_data: 0.008528354075074117
    double_data: 0.04769691882873518
    double_data: -0.004507115197809352
    double_data: 0.054512574128034404
    double_data: 0.004735883226566112
    double_data: -0.04109338638939924
    double_data: -0.01225185515640665
    double_data: 0.0211879047029829
    double_data: -0.03283552952258334
    double_data: -0.06847854970246905
    double_data: -0.03717830424290175
    double_data: 0.02229138542097568
    double_data: -0.0023302079081885985
    double_data: -0.01669715894296034
    double_data: 0.009106174302531645
    double_data: 0.0077108967914355665
    double_data: -0.012810205887961277
    double_data: -0.02377930687309051
    double_data: 0.05156636095017339
    double_data: -0.030017912255611612
    double_data: 0.016042332732435553
    double_data: -0.061685068037456055
    double_data: -0.0017479954564318828
    double_data: 0.015505121261011912
    double_data: 0.02324179171267747
    double_data: 0.013857306527908718
    double_data: -0.027713319824242445
    double_data: -0.02070481522848242
    double_data: -0.06392628909228877
    double_data: 0.042879768262208344
    double_data: -0.011788196459757035
    double_data: 0.04174924064068694
    double_data: 0.010854332909726384
    double_data: 0.018254598898871797
    double_data: 0.027434886755000984
    double_data: -0.003242764365808344
    double_data: -0.06510116523294626
    double_data: 0.007977800770405238
    double_data: 0.007963886064855345
    double_data: 0.006585970032626586
    double_data: -0.04367870140607582
    double_data: 0.016512328467945602
    double_data: 0.00732953087239851
    double_data: -0.019190043309565575
    double_data: -0.0037477016673892792
    double_data: 0.025318482422240947
    double_data: 0.01854448444914518
    double_data: 0.02084314468704717
    double_data: 0.02662506224619124
    double_data: -0.014299608588510974
    double_data: 0.006174290829272803
    double_data: 0.010653531158020426
    double_data: 0.026064946613714095
    double_data: -0.011208042322718326
    double_data: 0.055675714175684766
    double_data: 0.0638844237874589
    double_data: 0.003964725087150515
    double_data: -0.005617288033258108
    double_data: 0.02448450539515694
    double_data: 0.06303172567468257
    double_data: 0.02971498038319482
    double_data: -0.04291025247120053
    double_data: 0.014841383560801797
    double_data: 0.01723596875931703
    double_data: -0.02042389820006518
    double_data: -0.039630262884442206
    double_data: 0.004491518267417992
    double_data: 0.017670243945797033
    double_data: -0.007619212811680501
    double_data: -0.023205412089205853
    double_data: 0.02091648933761249
    double_data: 0.03308576884073225
    double_data: -0.012376511720059213
    double_data: -0.02364731075003553
    double_data: -0.03895500133504043
    double_data: 0.008498239151845787
    double_data: 0.008854682440502675
    double_data: -0.03696350509430374
    double_data: 0.0525173124120001
    double_data: 0.006035518771076449
    double_data: 0.01722219299018911
    double_data: 0.005410349497103406
    double_data: 0.037486736433046695
    double_data: 0.034426823843883486
    double_data: 0.015800620580464917
    double_data: -0.006392711744053211
    double_data: 0.0008142153694114848
    double_data: 0.009232941834389231
    double_data: 0.04781435999998859
    double_data: -0.05014546180483094
    double_data: -0.015678535399612233
    double_data: -0.01400304989227879
    double_data: -0.04713288516201338
    double_data: -0.004178792626763576
    double_data: -0.020221368081807935
    double_data: 0.06358631547004993
    double_data: 0.03416611720887137
    double_data: 0.0254234199021022
    double_data: -0.004337829077170691
    double_data: 0.007109848929290967
    double_data: 0.048904382385721666
    double_data: -0.03077166838861581
    double_data: -0.010709241660779847
    double_data: -0.00235095786740505
    double_data: -0.013099642622111904
    double_data: -0.06195563166253149
    double_data: 0.027257034596430224
    double_data: 0.030611252366517426
    double_data: -0.04253309645044091
    double_data: 0.03586132295431985
    double_data: -0.059947898576363054
    double_data: 0.02368637250523646
    double_data: 0.019183556589274595
    double_data: -0.0032351991591926684
    double_data: -0.05740119954710283
    double_data: 0.020193558300418375
    double_data: 0.03963357801547956
    double_data: 0.019837972196720708
    double_data: -0.014612244766333703
    double_data: -0.01302734418983566
    double_data: -0.02516869696894973
    double_data: 0.04602302444987413
    double_data: -0.002684979761133837
    double_data: -0.011275014617405448
    double_data: -0.041005503602257146
    double_data: -0.0019884442349691603
    double_data: -0.04470511596123421
    double_data: 0.010557181584521026
    double_data: 0.003933531975737964
    double_data: -0.018888325863042617
    double_data: -0.06328471067436632
    double_data: -0.03534854165002904
    double_data: 0.05296364140809549
    double_data: -0.0011254677230909634
    double_data: 0.02381791690056416
    double_data: 0.0542954259540435
    double_data: 0.021166694257174212
    double_data: 0.03126519242537604
    double_data: -0.03570096196570837
    double_data: -0.021266183755793533
    double_data: -0.0033872125696509936
    double_data: -0.02577083400962684
    double_data: -0.017504418665703306
    double_data: 0.004227103086001749
    double_data: 0.008080156259117656
    double_data: 0.0216269642626304
    double_data: -0.044832737277190504
    double_data: 0.0005169429903124613
    double_data: -0.0028827466825913687
    double_data: 0.03030891064636491
    double_data: -0.019565791903212983
    double_data: -0.021588767741941385
    double_data: 0.01275547339108813
    double_data: 0.04898287720595885
    double_data: -0.019685283191486293
    double_data: -0.031119076659773065
    double_data: 0.05210199372646537
    double_data: -0.04843037456849342
    double_data: -0.05037397522081492
    double_data: 0.04879860144541317
    double_data: -0.0016259553371865967
    double_data: -0.05498218192853113
    double_data: -0.008781822942123924
    double_data: -0.004947531254051913
    double_data: -0.036347084628059086
    double_data: 0.00024117662571401962
    double_data: 0.023293233572969085
    double_data: 0.004460058439512389
    double_data: -0.03507578484004153
    double_data: -0.010693140525938593
    double_data: 0.01604046772825795
    double_data: 0.005754048673017043
    double_data: -0.00874143339418783
    double_data: 0.051053805502246426
    double_data: -0.019416382535469984
    double_data: -0.014507382820046828
    double_data: 0.023683396045687432
    double_data: -0.005598306729155322
    double_data: -0.03659704402206329
    double_data: 0.029183884620637954
    double_data: 0.0053997041079432385
    double_data: -0.014538885334223713
    double_data: -0.055130002292550315
    double_data: -0.031656479946189024
    double_data: 0.06469420623869375
    double_data: 0.01001524359481116
    double_data: 0.006634449875882036
    double_data: 0.038049790616929736
    double_data: -0.046351850357875
    double_data: 0.07039613855350173
    double_data: 0.06061154446079385
    double_data: -0.04017020401867262
    double_data: -0.04085094915356823
    double_data: -0.0049616799696886125
    double_data: 0.033348038815325366
    double_data: 0.02068612464345563
    double_data: 0.01397365824316597
    double_data: -0.009103430932876222
    double_data: -0.0027184737714447144
    double_data: -0.018517682800469094
    double_data: -0.05294594816126131
    double_data: 0.012141101984431215
    double_data: 0.032924113546876
    double_data: 0.014345561280194423
    double_data: -0.028875341318178246
    double_data: -0.04547298235903645
    double_data: 0.02487121720689315
    double_data: -0.0017115383916371488
    double_data: -0.025661156282378382
    double_data: 0.023816196360676233
    double_data: 0.03700134064812597
    double_data: -1.8193445355997462e-05
    double_data: -0.003871785876181521
    double_data: 0.008280496357722841
    double_data: 0.020779772077396792
    double_data: -0.03476824336198044
    double_data: -0.018840256953508095
    double_data: -0.05674939650008891
    double_data: 0.035097692972966985
    double_data: 0.02284878920275461
    double_data: -0.0014212046346001406
    double_data: -0.0450389189939705
    double_data: 0.011808699335928758
    double_data: -0.05107322248300478
    double_data: 0.02075797081380247
    double_data: 0.019241589289946577
    double_data: 0.0008149970726915122
    double_data: 0.04649249578666688
    double_data: -0.012622851211217716
    double_data: -0.04145873695614096
    double_data: -0.0417101257916618
    double_data: 0.03476394437889625
    double_data: 0.011066789194080105
    double_data: -0.04381814796439231
    double_data: -0.002770360716775091
    double_data: 0.005682197658004813
    double_data: -0.025851135827685973
    double_data: -0.028690129199140057
    double_data: -0.04099603578585199
    double_data: 0.04235095259935503
    double_data: -0.03863014457517159
    double_data: 0.004183858428433312
    double_data: -0.014981947398128383
    double_data: 0.03598715395117336
    double_data: -0.01873073267043564
    double_data: -0.034039485953617
    double_data: -0.041977616038827104
    double_data: 0.026573518394514224
    double_data: -0.020312167193426087
    double_data: -0.04134196556369624
    double_data: 0.012565882061816877
    double_data: 0.030887389571998894
    double_data: -0.022795696804219726
    double_data: 0.033239722876341846
    double_data: -0.026415252087631312
    double_data: -0.04897076342328233
    double_data: -0.006546449986019588
    double_data: -0.0263082596034745
    double_data: 0.06112182193595548
    double_data: 0.032224797911331246
    double_data: 0.05316371626178644
