ir_version: 3
producer_name: "onnx-tensorflow"
graph {
  node {
    input: "Placeholder"
    output: "Cast"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 11
      type: INT
    }
  }
  node {
    input: "h1/weights"
    output: "h1/weights/read"
    name: "h1/weights/read"
    op_type: "Identity"
  }
  node {
    input: "Cast"
    input: "h1/weights/read"
    output: "h1/MatMul"
    name: "h1/MatMul"
    op_type: "MatMul"
  }
  node {
    input: "h1/biases"
    output: "h1/biases/read"
    name: "h1/biases/read"
    op_type: "Identity"
  }
  node {
    input: "h1/MatMul"
    input: "h1/biases/read"
    output: "h1/add"
    name: "h1/add"
    op_type: "Add"
    attribute {
      name: "broadcast"
      i: 1
      type: INT
    }
  }
  node {
    input: "h1/add"
    output: "h1/Relu"
    name: "h1/Relu"
    op_type: "Relu"
  }
  node {
    input: "h2/weights"
    output: "h2/weights/read"
    name: "h2/weights/read"
    op_type: "Identity"
  }
  node {
    input: "h1/Relu"
    input: "h2/weights/read"
    output: "h2/MatMul"
    name: "h2/MatMul"
    op_type: "MatMul"
  }
  node {
    input: "h2/biases"
    output: "h2/biases/read"
    name: "h2/biases/read"
    op_type: "Identity"
  }
  node {
    input: "h2/MatMul"
    input: "h2/biases/read"
    output: "h2/add"
    name: "h2/add"
    op_type: "Add"
    attribute {
      name: "broadcast"
      i: 1
      type: INT
    }
  }
  node {
    input: "h2/add"
    output: "h2/Relu"
    name: "h2/Relu"
    op_type: "Relu"
  }
  node {
    input: "h3/weights"
    output: "h3/weights/read"
    name: "h3/weights/read"
    op_type: "Identity"
  }
  node {
    input: "h2/Relu"
    input: "h3/weights/read"
    output: "h3/MatMul"
    name: "h3/MatMul"
    op_type: "MatMul"
  }
  node {
    input: "h3/biases"
    output: "h3/biases/read"
    name: "h3/biases/read"
    op_type: "Identity"
  }
  node {
    input: "h3/MatMul"
    input: "h3/biases/read"
    output: "h3/add"
    name: "h3/add"
    op_type: "Add"
    attribute {
      name: "broadcast"
      i: 1
      type: INT
    }
  }
  node {
    input: "h3/add"
    output: "h3/Relu"
    name: "h3/Relu"
    op_type: "Relu"
  }
  node {
    input: "output/weights"
    output: "output/weights/read"
    name: "output/weights/read"
    op_type: "Identity"
  }
  node {
    input: "h3/Relu"
    input: "output/weights/read"
    output: "output/MatMul"
    name: "output/MatMul"
    op_type: "MatMul"
  }
  node {
    input: "output/biases"
    output: "output/biases/read"
    name: "output/biases/read"
    op_type: "Identity"
  }
  node {
    input: "output/MatMul"
    input: "output/biases/read"
    output: "output/add"
    name: "output/add"
    op_type: "Add"
    attribute {
      name: "broadcast"
      i: 1
      type: INT
    }
  }
  name: "output/add"
  initializer {
    dims: 784
    dims: 16
    data_type: DOUBLE
    name: "h1/weights"
    double_data: -0.03386559552298585
    double_data: -0.02425772719626078
    double_data: 0.0024180028167935007
    double_data: 0.005981654502469206
    double_data: 0.026735620893347453
    double_data: 0.002798602469926416
    double_data: 0.03064666295077085
    double_data: 0.014817927035113417
    double_data: -0.03144007274583976
    double_data: 0.0011478431548274679
    double_data: -0.05717219181488027
    double_data: -0.039845687224997116
    double_data: -0.04707348018917189
    double_data: -0.06017949061136149
    double_data: -0.006142301462363659
    double_data: -0.006230282025701336
    double_data: -0.00531330541690843
    double_data: 0.01831695823268917
    double_data: 0.005451815351289922
    double_data: -0.011907372582582232
    double_data: 0.013639932373103344
    double_data: -0.035792981631344374
    double_data: -0.013847158433813058
    double_data: -0.028306004086968192
    double_data: -0.00515711767794111
    double_data: 0.02918300526358878
    double_data: 0.07090970517032211
    double_data: -0.031337206111624466
    double_data: -0.0012181088681054574
    double_data: 0.007880593959052393
    double_data: -0.012721866605271042
    double_data: -0.0025375346850805974
    double_data: 0.05210633816618646
    double_data: 0.027706360732181877
    double_data: 0.019877396003062556
    double_data: -0.02304374714336787
    double_data: 0.021189026359041276
    double_data: -0.043660220497341536
    double_data: -0.03252617462989828
    double_data: 0.003740138312052786
    double_data: 0.019029595952968135
    double_data: -0.036706526301877984
    double_data: -0.02130346362950436
    double_data: 0.004785075352364963
    double_data: -0.019320437262896593
    double_data: -0.05127565306161808
    double_data: -0.058218438409936416
    double_data: -0.01836197782621338
    double_data: 0.010807585095634918
    double_data: 0.049853139421381115
    double_data: -0.04201946622783457
    double_data: 0.06994233453438299
    double_data: 0.026355957298799505
    double_data: -0.02538319143383867
    double_data: -0.04925363771153387
    double_data: -0.027786954127357988
    double_data: 0.04583074070492653
    double_data: -0.045057648066600606
    double_data: -0.0044962230690067185
    double_data: 0.013083199033639921
    double_data: -0.0014185992178023165
    double_data: 0.027232076224752138
    double_data: 0.020808283622856544
    double_data: 0.032747107270250785
    double_data: 0.0032279428879264807
    double_data: 0.007838954194790413
    double_data: -0.0348669239433654
    double_data: 0.011480932938696538
    double_data: 0.0515578913807521
    double_data: -0.01515249419246709
    double_data: 0.01639046060620626
    double_data: 0.06153159392944959
    double_data: -0.047929237085167206
    double_data: 0.02201069581360107
    double_data: 0.030848109041285637
    double_data: -0.029153839343833837
    double_data: -0.018553432644099987
    double_data: 0.03615211526284518
    double_data: 0.04106018450862756
    double_data: -0.014552613516168014
    double_data: 0.02164202077989737
    double_data: 0.028344652344493505
    double_data: 0.04145273107117225
    double_data: -0.04023462421478862
    double_data: 0.00908904859070252
    double_data: -0.00820097133622383
    double_data: -0.002549400204396313
    double_data: -0.045778276352552584
    double_data: 0.05548053378493524
    double_data: -0.01359624185467711
    double_data: -0.017608426923841458
    double_data: -0.03066707540974659
    double_data: -0.0685211509007216
    double_data: -0.0011319334959786953
    double_data: -0.013386961343046068
    double_data: 0.0490563639299901
    double_data: -0.0075413212231108025
    double_data: 0.026362473310909157
    double_data: -0.005963629781634061
    double_data: -0.01107742797349858
    double_data: 0.022471678826336928
    double_data: 0.026697538711502565
    double_data: 0.06595182670042332
    double_data: 0.0008912855032562296
    double_data: 0.020541213391233205
    double_data: -0.047215582226380844
    double_data: 0.00730466201992439
    double_data: -0.010839142760856808
    double_data: -0.004618883065881604
    double_data: 0.046506166148998745
    double_data: -0.00011836536478240886
    double_data: -0.019216224098820463
    double_data: -0.0006372387595533562
    double_data: 0.0002557210046781502
    double_data: -0.02084964765287021
    double_data: -0.05491407165250806
    double_data: -0.010485027676492106
    double_data: 0.02111365115144634
    double_data: -0.04986450791193939
    double_data: -0.023017667647927294
    double_data: -0.025421218891329825
    double_data: -0.02404248225874676
    double_data: -0.0035049568817915222
    double_data: 0.033610569506002774
    double_data: 0.008290029508700225
    double_data: -0.0272654698652423
    double_data: 0.02072048526797526
    double_data: 0.054942102584469646
    double_data: 0.025949014605907393
    double_data: -0.01860817957516296
    double_data: 0.029882035067295618
    double_data: -0.014897814382961994
    double_data: -0.007850561623582072
    double_data: 0.06764254178918805
    double_data: -0.009949159468616327
    double_data: 0.022786611857969825
    double_data: -0.03266767182832705
    double_data: -0.0014300742511198828
    double_data: -0.04498947435175957
    double_data: -0.009466793411126837
    double_data: 0.004355630235063665
    double_data: 0.015711854995081185
    double_data: -0.023641640851575697
    double_data: 0.001189513681300869
    double_data: -0.02528316716457889
    double_data: -0.026744400021132583
    double_data: -0.0035310661226491103
    double_data: -0.041328510637757145
    double_data: 0.004217734478905217
    double_data: -0.04358113782982164
    double_data: 0.012072598950290942
    double_data: -0.016646757540598498
    double_data: -0.027426873676421316
    double_data: -0.0189436136427954
    double_data: 0.026187012945192465
    double_data: -0.008051452600836359
    double_data: 0.03623203825783114
    double_data: -0.003598800531596198
    double_data: -0.039221957349907445
    double_data: -0.022186447060633132
    double_data: 3.538433036818103e-05
    double_data: -0.0026500712461466226
    double_data: -0.06604950210875092
    double_data: -0.06017866791997952
    double_data: -0.009482365590782334
    double_data: 0.024914031061275363
    double_data: -0.063461000247285
    double_data: -0.002670444506324447
    double_data: 0.04323193463020732
    double_data: -0.03882024180172112
    double_data: 0.06813232174992483
    double_data: 0.008800798692854264
    double_data: 0.056873696511464025
    double_data: -0.0171240229951072
    double_data: -0.025713358561313307
    double_data: 0.034050782465195426
    double_data: -0.07038278358552125
    double_data: -0.05034163780180668
    double_data: 0.02028280928903327
    double_data: 0.037119900495884754
    double_data: 0.02292228227469903
    double_data: 0.009176628778084646
    double_data: -0.00867794338946578
    double_data: -0.009761019369969435
    double_data: -0.04064665178539606
    double_data: 0.013636626664379776
    double_data: 0.004757780905932277
    double_data: -0.01091286118447729
    double_data: 0.044893738316974914
    double_data: 0.02820704655397194
    double_data: 0.01651832501966644
    double_data: 0.0189410531018871
    double_data: 0.03214537354352289
    double_data: -0.053321155678758766
    double_data: 0.0325158320890213
    double_data: 0.009428073664938448
    double_data: 0.060221186828016235
    double_data: 0.007695305094947945
    double_data: 0.04968052066155657
    double_data: 0.0068650261798009924
    double_data: -0.027813606144098738
    double_data: 0.011193652109545234
    double_data: 0.06310594951976296
    double_data: -0.020027491802437312
    double_data: 0.030893265156640405
    double_data: -0.00319030794979986
    double_data: -0.035619212517997934
    double_data: -0.00863911519596266
    double_data: -0.019517296427968258
    double_data: 0.0052119101473259745
    double_data: -0.038889022799198855
    double_data: 0.04466332125816494
    double_data: -0.0356469006281226
    double_data: 0.01852373406821881
    double_data: 0.03823225326270412
    double_data: -0.013164661644662127
    double_data: 0.0231539817448779
    double_data: -0.016877794154198676
    double_data: -0.0021135075703436717
    double_data: -0.02566625214614971
    double_data: 0.01673760731050547
    double_data: -0.05507234319517875
    double_data: -0.011188550295817933
    double_data: 0.021400355001762947
    double_data: -0.00757442264508181
    double_data: -0.015122811332076798
    double_data: -0.006401000554068244
    double_data: -0.03300221427065288
    double_data: 0.03480443804484907
    double_data: 0.041005237389098746
    double_data: -0.02281002133429045
    double_data: 0.00376601930218808
    double_data: 0.03098488630898772
    double_data: 0.02546708355200881
    double_data: -0.03848301424012003
    double_data: 0.033938485276117814
    double_data: -0.013552113029635717
    double_data: -0.03821160793795677
    double_data: -0.0058619151129085684
    double_data: -0.009012285817255774
    double_data: -0.05426746214221168
    double_data: -0.007212044425519275
    double_data: -0.042252116119768764
    double_data: -0.007482298475281977
    double_data: -0.02227525668087362
    double_data: 0.03504551357705631
    double_data: -0.02286113693270295
    double_data: 0.030072627338620775
    double_data: 0.03757169299605637
    double_data: 0.01812795653362823
    double_data: 0.0335843024851955
    double_data: -0.04944431734076316
    double_data: -0.02660726981123228
    double_data: -0.06248303729951568
    double_data: -0.06951489157746628
    double_data: -0.0025414027164488632
    double_data: -0.03607161515882896
    double_data: 0.043350128485866515
    double_data: -0.02700218103805373
    double_data: 0.02675986531542751
    double_data: -0.004736202257775602
    double_data: 0.02097938423513552
    double_data: 0.0030282739868499418
    double_data: -0.024174654401111505
    double_data: 0.008282944872074094
    double_data: 0.056717256689351576
    double_data: 0.052536672633968384
    double_data: -0.029134499519916767
    double_data: -0.04011698862587962
    double_data: 0.025317058821835686
    double_data: -0.01668602949246386
    double_data: -0.012014973811971518
    double_data: 0.026161068436327956
    double_data: 0.018650413150042507
    double_data: -0.03773360574274546
    double_data: -0.007824323248362651
    double_data: 0.007224101535075984
    double_data: 0.01687522860576207
    double_data: 0.01488114585426904
    double_data: -0.04279056466217731
    double_data: 0.02049804946434028
    double_data: 0.03216946014620583
    double_data: -0.044568443473842416
    double_data: 0.025018235039394474
    double_data: 0.00038983008808939816
    double_data: -0.029652647609127846
    double_data: 0.006685884506196342
    double_data: 0.055459070093161464
    double_data: -0.0358228388301117
    double_data: 0.03508036750535688
    double_data: -0.005430909655718055
    double_data: -0.01665448303330344
    double_data: 0.020176085032750885
    double_data: -0.0166600792857546
    double_data: -0.03617362617160729
    double_data: -0.04665516406905681
    double_data: -0.005360639645028612
    double_data: 0.069464232235262
    double_data: -0.021764418683332287
    double_data: -0.01370606326116864
    double_data: -0.019720987236294438
    double_data: -0.033074818769687264
    double_data: 0.03508680578229622
    double_data: 0.0009150651846419693
    double_data: -0.01585800074521304
    double_data: -0.03830705004830922
    double_data: -0.04483991048490216
    double_data: 0.02822199974477008
    double_data: -0.03604935671048857
    double_data: 0.05605547193879401
    double_data: -0.007135122510792024
    double_data: -0.030681352767644006
    double_data: 0.047152252795407266
    double_data: 0.005378714589534312
    double_data: 0.01664205946843721
    double_data: -0.01838001852072957
    double_data: -0.012026631514200827
    double_data: 0.03429237215138466
    double_data: 0.004529521966031417
    double_data: -0.019424100485159204
    double_data: 0.00815544445666405
    double_data: -0.0253498362981404
    double_data: 0.04988088937378652
    double_data: -0.014168333310165265
    double_data: 0.011675525444827278
    double_data: -0.006383828364542167
    double_data: 0.016112811975015327
    double_data: 0.042097703367233064
    double_data: -0.04420714659510528
    double_data: 0.04402575623448434
    double_data: -0.04553545175866825
    double_data: 0.005276003242534931
    double_data: -0.050732237196598126
    double_data: 0.04280581915839483
    double_data: -0.043834932562080896
    double_data: 0.006036039091494853
    double_data: 0.02479468110116847
    double_data: -0.00808039143125724
    double_data: 0.007690144469675595
    double_data: -0.0277697030668108
    double_data: 0.021950423056907434
    double_data: -0.007634572634669809
    double_data: 0.056673502642008385
    double_data: 0.011476822609765323
    double_data: 0.04686628813479546
    double_data: 0.003031681042186989
    double_data: 0.007369726761906696
    double_data: -0.0387447977308893
    double_data: -0.015814238201262834
    double_data: -0.040940493181699754
    double_data: 0.006732924953854022
    double_data: -0.007904040200271271
    double_data: 0.051103658315210465
    double_data: -0.01183980875940032
    double_data: -0.012662175590812268
    double_data: 0.025194479353850857
    double_data: -0.017031491005169614
    double_data: -0.010262650670054151
    double_data: -0.008519041952278606
    double_data: -0.00415703575463485
    double_data: -0.048153061895659655
    double_data: 0.009670931248857775
    double_data: 0.008247645584500404
    double_data: 0.0025325587668973007
    double_data: -0.03695712320041659
    double_data: 0.017921050718266496
    double_data: 0.0025171100176070407
    double_data: -0.006208065731678177
    double_data: 0.04782407221002855
    double_data: -0.0008015680948782875
    double_data: -0.0030513473705289424
    double_data: 0.021676594757610856
    double_data: 0.022629444795143703
    double_data: 0.055845901977752715
    double_data: 0.06603514373272101
    double_data: -0.009540889955826873
    double_data: -0.03286860700066906
    double_data: -0.04313683702530554
    double_data: -0.007880669589104225
    double_data: -0.016911760608629672
    double_data: -0.067213579217107
    double_data: -0.008623806108169466
    double_data: 0.03151503342743925
    double_data: -0.0036862398631197215
    double_data: 0.0070612481597008715
    double_data: -0.028659250937704422
    double_data: -0.02447907586517027
    double_data: -0.04860806524058374
    double_data: 0.021452170713180785
    double_data: -0.04670269686034115
    double_data: 0.02593288287869644
    double_data: -0.026671315423040493
    double_data: -0.020789366213034857
    double_data: 0.013325427260294738
    double_data: 0.025730214451875878
    double_data: -8.491177226647969e-05
    double_data: -0.0370571613033931
    double_data: -0.029269776210736148
    double_data: 0.03372302988562417
    double_data: -0.03256067378207213
    double_data: 0.0308978643939927
    double_data: 0.04185993673250739
    double_data: -0.056063172152366815
    double_data: 0.014836633948971889
    double_data: -0.00933229422670176
    double_data: -0.004656776435167361
    double_data: -0.015278464619360482
    double_data: -0.012471291551412933
    double_data: 0.007377352658432803
    double_data: -0.06987630647562264
    double_data: -0.03869666986185977
    double_data: -0.05977120684201387
    double_data: 0.03138569153323468
    double_data: -0.003477541583429842
    double_data: 0.0067999725823307666
    double_data: -0.04239877150898396
    double_data: -0.02284710401256055
    double_data: 0.02381008667880309
    double_data: -0.008853840300545614
    double_data: 0.026249445020526584
    double_data: 0.010352604842101723
    double_data: -0.04394105892221432
    double_data: 0.004806462441980139
    double_data: -0.017522944123981816
    double_data: 0.04773092808468318
    double_data: -0.007262931360349648
    double_data: 0.03241370802753663
    double_data: -0.009260404259412342
    double_data: -0.06964758188864051
    double_data: 0.010749941659648675
    double_data: -0.03097455140517569
    double_data: -0.05306069804757169
    double_data: 0.008912684603865788
    double_data: -0.04658957084013654
    double_data: 0.04410772126209979
    double_data: 0.022755762481168385
    double_data: -0.0036978313178639447
    double_data: 0.00682008874704565
    double_data: 0.0009129113684815685
    double_data: 0.06266736601680012
    double_data: 0.03427466587111113
    double_data: -0.037384230516577195
    double_data: -0.005954009176329674
    double_data: -0.02258578124833227
    double_data: 0.04801019045063266
    double_data: 0.018979889274541265
    double_data: 0.015024209802142419
    double_data: 0.01796211958270851
    double_data: -0.014546753008661543
    double_data: 0.02880637995262973
    double_data: 0.023909852861417197
    double_data: -0.0031759693218551153
    double_data: 0.024445458314636268
    double_data: -0.020200891882956235
    double_data: 0.003869565189117502
    double_data: -0.04776138364915365
    double_data: 0.017816255912794298
    double_data: 0.028950921322600142
    double_data: 0.025770262693701737
    double_data: -0.013763340153125529
    double_data: 0.04065353661015572
    double_data: 0.026228496678711608
    double_data: 0.05140743973072642
    double_data: -0.04755836850374773
    double_data: 0.02804993155458701
    double_data: -0.015947446691862186
    double_data: -0.0009648035641707492
    double_data: 0.010225499961848144
    double_data: -0.054883579262467765
    double_data: -0.01394575688596169
    double_data: 0.009974762823902946
    double_data: -0.018735857231748313
    double_data: -0.04762066837868892
    double_data: 0.047783665558362186
    double_data: -0.024215141148368275
    double_data: -0.014317071668025433
    double_data: 0.054783075121942165
    double_data: -0.011346552654225755
    double_data: 0.004858470607963719
    double_data: 0.04777983946147544
    double_data: 0.0404437162597471
    double_data: 0.037345470789673874
    double_data: 0.002579141990957145
    double_data: 0.006046273732111832
    double_data: -0.003999097628535005
    double_data: 0.009556965548622835
    double_data: 0.01605575464122995
    double_data: -0.021628014441679205
    double_data: 0.007819364392143636
    double_data: -0.003839820331692974
    double_data: 0.0531241507936689
    double_data: 0.02537878647985284
    double_data: 0.06298046035364245
    double_data: -0.008672771643164118
    double_data: 0.023582247127584693
    double_data: 0.02222546636799472
    double_data: 0.050460332121707335
    double_data: 0.051581176645410065
    double_data: -0.01931807247819174
    double_data: 0.015285741768115802
    double_data: -0.031182107435991483
    double_data: 0.04471949426946944
    double_data: -0.024281421645026308
    double_data: -0.047040700933809944
    double_data: 0.002736218286432054
    double_data: 0.044397378783345744
    double_data: 0.012782791941265706
    double_data: -0.035590297362318356
    double_data: 0.012078549319633446
    double_data: 0.00019005731758192423
    double_data: 0.025752570295705723
    double_data: 0.012930568661788149
    double_data: -0.015153672350093152
    double_data: 0.0312760794373258
    double_data: -0.04117105736661905
    double_data: -0.021758986309759032
    double_data: 0.005233230318093806
    double_data: 0.03387627561408996
    double_data: 0.008549919423489325
    double_data: -0.03373384970717362
    double_data: 0.013576887726883612
    double_data: 0.02956900888553634
    double_data: -0.01153305823937192
    double_data: -0.007355339958944442
    double_data: -0.025552242568603542
    double_data: 0.0010262012253243432
    double_data: 0.005246732711780788
    double_data: -0.048709366735767035
    double_data: 0.0061161419463713574
    double_data: -0.0024254860216011177
    double_data: 0.03140154921709573
    double_data: -0.035574493958069324
    double_data: 0.03832654413226319
    double_data: 0.05112539869472436
    double_data: 0.02200934018835816
    double_data: -0.029470877589435115
    double_data: -0.05694663747832675
    double_data: -0.005876369331442561
    double_data: -0.06309847953458131
    double_data: -0.0602903876372685
    double_data: -0.011006254259245044
    double_data: 0.050827081394044564
    double_data: 0.032405870694083974
    double_data: -0.06362550508683998
    double_data: -0.031987275206204556
    double_data: -0.015894235031774843
    double_data: -0.026038185271681613
    double_data: 0.0477820469751229
    double_data: -0.03211198515587398
    double_data: 0.0020671413665173306
    double_data: -0.002312460960033427
    double_data: 0.03253392771303211
    double_data: 0.02416800103999548
    double_data: 0.02166764598077569
    double_data: 0.05125127693905647
    double_data: 0.06287547611730808
    double_data: -0.022740716544588833
    double_data: 0.013534236880883689
    double_data: 0.024765508796318197
    double_data: -0.035671488925819374
    double_data: -0.02310858868873034
    double_data: -0.05943623464723114
    double_data: -0.020325658601816683
    double_data: 0.04596088243053969
    double_data: -0.007063982586752128
    double_data: 0.01203097647183564
    double_data: -0.12241420360964844
    double_data: -0.027103146340142135
    double_data: 0.018473659077985184
    double_data: -0.0007592732998903413
    double_data: 0.10190058358572023
    double_data: -0.04726659982281189
    double_data: -0.045362766058719924
    double_data: 0.04827507637930321
    double_data: -0.0023520945422220714
    double_data: 0.052523589780234047
    double_data: -0.04006018644915229
    double_data: -0.002440127229670671
    double_data: -0.03300305712768401
    double_data: 0.012166898491283738
    double_data: 0.0009186290353211742
    double_data: 0.02528008212975664
    double_data: -0.051756096933657084
    double_data: -0.03597559563855194
    double_data: -0.007000046406445401
    double_data: -0.0015637069483665708
    double_data: 0.051249029406304124
    double_data: -0.06243628383234792
    double_data: 0.04625143844514874
    double_data: 0.013038961237927311
    double_data: 0.011278027099603192
    double_data: -0.04908885812656981
    double_data: 0.0360868313102569
    double_data: 0.006871324191636872
    double_data: -0.003210957855732311
    double_data: 0.013205381545658833
    double_data: -0.008731969760557947
    double_data: 0.020180336628331595
    double_data: 0.03475679083863453
    double_data: 0.06780474511463234
    double_data: 0.022591565777010103
    double_data: 0.02289837257728673
    double_data: 0.03911397018855764
    double_data: 0.011842317074136749
    double_data: 0.0014922192015974676
    double_data: 0.03606472885462673
    double_data: 0.05061984226071568
    double_data: -0.0025203669101463897
    double_data: -0.004196281703252729
    double_data: 0.008192522060075185
    double_data: -0.04537465295063031
    double_data: 0.028449346331189805
    double_data: 0.05441541640222402
    double_data: 0.03007187517798719
    double_data: 0.021370697736720724
    double_data: 0.03142599317764829
    double_data: 0.009557622667443833
    double_data: 0.049338542715147024
    double_data: 0.05921480153171732
    double_data: 0.007623876539448923
    double_data: 0.018610320107518837
    double_data: -0.018504876288641052
    double_data: 0.02852261060611237
    double_data: -0.006722937545806614
    double_data: -0.02220783700207336
    double_data: 0.05944219263408095
    double_data: -0.025428200577025144
    double_data: -0.018837485456386836
    double_data: -0.030566293918932938
    double_data: 0.044968135450843466
    double_data: -0.026015829274862835
    double_data: 0.017958912859473476
    double_data: 0.005668624983902184
    double_data: 0.007552101875646535
    double_data: -0.01043752105774949
    double_data: -0.024418248172014663
    double_data: 0.009251859198139575
    double_data: -0.09548955730322795
    double_data: -0.0066381089586439335
    double_data: -0.05671761554914095
    double_data: 0.00783824308808861
    double_data: 0.025776117212784635
    double_data: 0.0138745799435895
    double_data: 0.008762380396299238
    double_data: 0.01737470566424112
    double_data: -0.01624925736969886
    double_data: -0.02538054315482065
    double_data: 0.01053887421686588
    double_data: -0.04076879875469459
    double_data: -0.05917496402049309
    double_data: 0.11432855185591795
    double_data: 0.05070488496694939
    double_data: 0.009844557203785674
    double_data: -0.03219666087152779
    double_data: -0.02350744507569205
    double_data: 0.03505707533157907
    double_data: -0.02151913082180362
    double_data: 0.016120663809066967
    double_data: 0.03866504176754655
    double_data: 0.0006280774590702412
    double_data: -0.02884451408929305
    double_data: 0.003895693980709712
    double_data: -0.09660001113280764
    double_data: 0.028434999221903075
    double_data: 0.04062330582580086
    double_data: -0.038422140835648176
    double_data: 0.0983032151709568
    double_data: 0.044770611719501544
    double_data: -0.014739481061981637
    double_data: -0.022200220108442633
    double_data: -0.03731548319050767
    double_data: 0.007300140896727099
    double_data: -0.023339861177117654
    double_data: 0.03405989788922416
    double_data: 0.03987513669596807
    double_data: -0.03602678060467854
    double_data: 0.03618683293542178
    double_data: 0.03245414987493569
    double_data: 0.02137998655987653
    double_data: -0.03879267110616506
    double_data: -0.0019411791081653553
    double_data: -0.0066665150998643785
    double_data: -0.04626398631257445
    double_data: 0.0271100344032843
    double_data: 0.009517560194193317
    double_data: -0.005606380503788973
    double_data: -0.004578468023793818
    double_data: -0.048939941645679295
    double_data: 0.017405004951245445
    double_data: -0.020896929112570812
    double_data: -0.040175436753419225
    double_data: -0.06021288164145088
    double_data: -0.0074477737000098135
    double_data: -0.009608064791389849
    double_data: -0.04759345116708036
    double_data: -0.0226795141810741
    double_data: 0.050263701481807546
    double_data: -0.060846711033667795
    double_data: 0.0015661571178264206
    double_data: 0.013687063798805753
    double_data: 0.013625341087991393
    double_data: -0.05052355942548793
    double_data: -0.0033608328205209786
    double_data: -0.04250129225687197
    double_data: -0.0243163066727367
    double_data: -0.0357949603928133
    double_data: 0.007573294287553499
    double_data: -0.005257046383510585
    double_data: 0.003565645495755487
    double_data: -0.035570041323492924
    double_data: -0.19068580721077563
    double_data: -0.04099758902376413
    double_data: 0.06945830235924548
    double_data: -0.05251952382845709
    double_data: 0.07523511817981904
    double_data: 0.03560839716746444
    double_data: -0.04240691415000967
    double_data: 0.021116508250148023
    double_data: 0.06624021905265998
    double_data: -0.022402894108206253
    double_data: 0.007209529174795548
    double_data: -0.01167794439061177
    double_data: -0.01829018517271847
    double_data: -0.020982410589919533
    double_data: 0.02791447293549833
    double_data: -0.053166126240612364
    double_data: -0.04158728017377793
    double_data: 0.0036206050159691954
    double_data: 0.05828758317707675
    double_data: -0.03872480548482675
    double_data: 0.06960696490234417
    double_data: 0.018270866890467113
    double_data: 0.05168359910898567
    double_data: -0.0035286432712491283
    double_data: -0.039553930450683075
    double_data: 0.011644584059511267
    double_data: -0.0026742924119883948
    double_data: -0.016000934812511573
    double_data: -0.008086184996375142
    double_data: -0.023742475238714672
    double_data: -0.06740876204780231
    double_data: 0.01553350648293163
    double_data: -0.024454619367992893
    double_data: 0.023724885978724568
    double_data: -0.02427256388339861
    double_data: -0.02938361943356929
    double_data: -0.005687938621410706
    double_data: -0.04091319452100483
    double_data: -0.004080483208791351
    double_data: -0.002746290683406596
    double_data: 0.022745902769452493
    double_data: -0.046933308716506146
    double_data: 0.010224537287841813
    double_data: -0.038428987027084326
    double_data: -0.021509959421667977
    double_data: -0.05299344794042624
    double_data: -0.03519373607623081
    double_data: -0.015905889467987835
    double_data: -0.07891753346825581
    double_data: 0.03685497785940806
    double_data: -0.06329252668162305
    double_data: 0.015076197211829742
    double_data: 0.049126090615033605
    double_data: -0.01979996006869552
    double_data: -0.012474321083419957
    double_data: 0.0013739964959890636
    double_data: -0.02108135705678702
    double_data: -0.027798668846324558
    double_data: -0.010985290650359358
    double_data: 0.006174645257529185
    double_data: 0.0019337995551641678
    double_data: -0.006314182384197251
    double_data: -0.019771047514325495
    double_data: 0.02914289910442873
    double_data: -0.015464170472015462
    double_data: 0.03265909334212141
    double_data: -0.005213932353011886
    double_data: -0.001835990811343308
    double_data: 0.0055748702469266
    double_data: -0.024389264901279014
    double_data: -0.0064303942702537455
    double_data: 0.012410571722496848
    double_data: -0.04049167828516695
    double_data: -0.05505548328696904
    double_data: -0.044982539496882155
    double_data: 0.0267697771937763
    double_data: -0.02897305097054799
    double_data: 0.037724879783005955
    double_data: 0.04410516263547367
    double_data: 0.030821689791177012
    double_data: -0.1100921350726225
    double_data: 0.005489328308353552
    double_data: -0.04661819660134315
    double_data: 0.007600797821675545
    double_data: 0.07558449274510626
    double_data: 0.11753274621488313
    double_data: -0.029994333175426758
    double_data: 0.034287558969510225
    double_data: -0.026223856790164802
    double_data: -0.024840201229531306
    double_data: -0.02140327744746813
    double_data: 0.005066948056716438
    double_data: 0.022850072704077674
    double_data: 0.002987316032337804
    double_data: -0.019411999686800012
    double_data: -0.010059084734114933
    double_data: -0.10152167525821675
    double_data: -0.01016389825154663
    double_data: 0.004673858016123853
    double_data: 0.038332645613709665
    double_data: 0.0929914752296598
    double_data: 0.08113315583270826
    double_data: 0.03590460590893676
    double_data: 0.017213564326151766
    double_data: -0.01465948010959783
    double_data: 0.008062896084790605
    double_data: -0.02960070966562441
    double_data: -0.01458736999787462
    double_data: 0.07344750745931962
    double_data: -0.0097783629181035
    double_data: 0.035662409590256655
    double_data: 0.035861952972900214
    double_data: -0.03760154256966076
    double_data: -0.067138564758281
    double_data: 0.0024627876655129682
    double_data: 0.004100201718577555
    double_data: 0.07349143660336958
    double_data: -0.0009508738683634847
    double_data: -0.002904723777584398
    double_data: 0.013379452567838238
    double_data: 0.039753378240820335
    double_data: -0.027700402314784895
    double_data: 0.056781849847371835
    double_data: 0.0200777151647362
    double_data: 0.05512878980158666
    double_data: -0.00709897684747574
    double_data: -0.05865206174399015
    double_data: -0.01779396506621647
    double_data: 0.005517785220454089
    double_data: -0.050243956288429814
    double_data: -0.006388945579898704
    double_data: 0.006061819196216258
    double_data: 0.02974164881172216
    double_data: -0.004368771853138293
    double_data: 0.03958511929157445
    double_data: 0.028335506121927565
    double_data: 0.05062969462282583
    double_data: 0.053121279896439444
    double_data: 0.009644603195603164
    double_data: 0.014043191510495455
    double_data: -0.05462918113298797
    double_data: 0.009077157010012918
    double_data: -0.0469542043413691
    double_data: 0.03278957221136242
    double_data: -0.007434852862242059
    double_data: -0.048940113803441626
    double_data: -0.01725488907640935
    double_data: 0.04191885880096979
    double_data: -0.06108153363141787
    double_data: -0.003464511197048649
    double_data: 0.028804617835880026
    double_data: -0.06623340556017784
    double_data: -0.03248577582744308
    double_data: 0.03429030509443906
    double_data: -0.002153430423102527
    double_data: 0.00829267004814021
    double_data: 0.017656034772645154
    double_data: 0.003929380486799047
    double_data: 0.006463622406300058
    double_data: 0.0028533872842488274
    double_data: 0.017788655186073702
    double_data: -0.006908215609854756
    double_data: -0.01731076409476729
    double_data: -0.063756891600619
    double_data: 0.007675885009773456
    double_data: 0.040350552088416446
    double_data: 0.037872182864973285
    double_data: -0.007219102527391943
    double_data: -0.03329644753408042
    double_data: 0.03008481394042296
    double_data: -0.010665653699100445
    double_data: -0.0028729494641710333
    double_data: -0.029953640849821828
    double_data: 0.008183876728188431
    double_data: -0.01022459595399649
    double_data: 0.03720185676934282
    double_data: -0.045701272742597554
    double_data: 0.01635096987716423
    double_data: -0.030621948328091137
    double_data: -0.050395422883731306
    double_data: 0.046864573044194426
    double_data: -0.021838197200947762
    double_data: -0.0086691480849347
    double_data: 0.027896555916316495
    double_data: 0.01180478444035173
    double_data: -0.017068855085740315
    double_data: 0.025038766044160214
    double_data: -0.015881459165737865
    double_data: 0.019508231139196676
    double_data: -0.0022636418730270624
    double_data: 0.06814010451096357
    double_data: -0.020252047310256045
    double_data: -0.022472139449842343
    double_data: 0.010809241370559478
    double_data: 0.011204071469084503
    double_data: 0.01578051732008802
    double_data: 0.032441418807976505
    double_data: 0.01721751169783734
    double_data: 0.04935541247665769
    double_data: 0.005830562383944954
    double_data: -0.006607166579840856
    double_data: -0.048859815353971194
    double_data: -0.006443169584898803
    double_data: 0.006344861408937377
    double_data: 0.05826388587503024
    double_data: 0.004834051113657131
    double_data: -0.03200600191645966
    double_data: -0.03673807723453272
    double_data: 0.031368241819504025
    double_data: -0.0555606021641357
    double_data: 0.01705887027147904
    double_data: -0.0007573486712678987
    double_data: 0.013688723619416952
    double_data: 0.06654324542368151
    double_data: 0.05782064965414485
    double_data: 0.015796320813893303
    double_data: 0.036855788738211125
    double_data: 0.031092626853322675
    double_data: -0.017268111096222852
    double_data: 0.023077119188832512
    double_data: 0.00800319756495285
    double_data: 0.01998101900468031
    double_data: 0.038775603875900115
    double_data: 0.0021127309529361767
    double_data: -0.033723199339792974
    double_data: -0.024872965602284983
    double_data: 0.03936800652467277
    double_data: 0.0033790056901073654
    double_data: -0.022450580732533535
    double_data: -0.023335052116810532
    double_data: -0.01637032449647392
    double_data: 0.028709910919262213
    double_data: 0.018371194667444222
    double_data: -0.03623678555126234
    double_data: 0.04188298897983451
    double_data: 0.014874672441938205
    double_data: 0.007225786546676267
    double_data: -0.015163095428495955
    double_data: -0.05440214346893615
    double_data: 0.013631006811898643
    double_data: 0.017721878254382355
    double_data: 0.023439468803562454
    double_data: -0.022109979246053183
    double_data: -0.023986445584594222
    double_data: -0.009715105720967893
    double_data: 0.027243090494464467
    double_data: -0.023005483780473526
    double_data: 0.023398187047959103
    double_data: -0.02565654173436365
    double_data: -0.014313224757617071
    double_data: 0.030586567052034618
    double_data: 0.011390629198153883
    double_data: 0.019194094800370032
    double_data: -0.013871689051809088
    double_data: -0.015402538105530168
    double_data: -0.010650219544219497
    double_data: 0.011481025287001196
    double_data: 0.038526780245005
    double_data: -0.021657920164746082
    double_data: -0.05274716098174095
    double_data: 0.020331392961159607
    double_data: -0.017494344190963237
    double_data: -0.03715990345014747
    double_data: -0.0006231228700092992
    double_data: 0.0602800418524904
    double_data: 0.009601913048100798
    double_data: 0.003951692012605686
    double_data: 0.008207645913903012
    double_data: 0.027047699553821865
    double_data: -0.0102115393026086
    double_data: -0.006874632202000691
    double_data: -0.029332592360262356
    double_data: 0.005201805765205636
    double_data: 0.0294167453367245
    double_data: 0.009941029168560118
    double_data: -0.07023310647487623
    double_data: -0.021118251466393935
    double_data: 0.029542424762502992
    double_data: 0.043649239108215866
    double_data: -0.002340431683197971
    double_data: 0.009138458397680075
    double_data: 0.018323187008383958
    double_data: 0.03219585998552912
    double_data: -0.013333649707170402
    double_data: 0.011337362030140748
    double_data: -0.005523148066003312
    double_data: -0.06983996178709038
    double_data: 0.005212945990868104
    double_data: -0.015491059486906388
    double_data: 0.06267278504471077
    double_data: -0.02230033958529397
    double_data: -0.029803142247439008
    double_data: 0.006374792603403093
    double_data: 0.020288641145850467
    double_data: 0.013406320890063838
    double_data: -0.003051385258131983
    double_data: -0.01258604954480147
    double_data: 0.015759971816780426
    double_data: -0.017961942015324982
    double_data: -0.01763618649446225
    double_data: 0.02079087634505849
    double_data: -0.06975769297869243
    double_data: 0.004159196543449079
    double_data: 0.03321415504158153
    double_data: -0.11774232567242106
    double_data: 0.03717125658395576
    double_data: 0.0307965855269781
    double_data: -0.05943843685281179
    double_data: 0.11647648625789521
    double_data: 0.010474786343972895
    double_data: 0.03266878987718987
    double_data: 0.012408657921186618
    double_data: 0.00806959037628498
    double_data: 0.030939511014683313
    double_data: -0.00899439037993263
    double_data: -0.010368061269562296
    double_data: 0.06053639238449085
    double_data: -0.026567354618274676
    double_data: 0.004401610650289342
    double_data: 0.00892255534336237
    double_data: -0.0390078763914857
    double_data: 0.07277999503197251
    double_data: 0.02956248333201222
    double_data: 0.01608998076454814
    double_data: 0.14663281147531212
    double_data: 0.05369651916875025
    double_data: -0.0659177792169954
    double_data: 0.03984397744108174
    double_data: -0.05020733011895935
    double_data: 0.05452322917569876
    double_data: 0.0037520804879127446
    double_data: 0.007524482378191286
    double_data: 0.048784587925370396
    double_data: 0.008616388925758297
    double_data: 0.04680005559432603
    double_data: 0.002141074148120681
    double_data: 0.014309889546291471
    double_data: 2.3018425120494443e-05
    double_data: 0.0575995981476034
    double_data: -0.016184503566871157
    double_data: 0.10257461947023815
    double_data: -0.05478218310986845
    double_data: -0.040886966372429605
    double_data: 0.02347528100079835
    double_data: -0.09434812840295159
    double_data: -0.04111265368760194
    double_data: 0.010693848078401286
    double_data: -0.02728750653295983
    double_data: 0.09253190539944017
    double_data: -0.013315918781331053
    double_data: 0.10704280898492752
    double_data: 0.07423601509550821
    double_data: -0.04581329079699964
    double_data: -0.04096155637764804
    double_data: -0.03014776182807448
    double_data: 0.03176773673717448
    double_data: 0.08286719117873897
    double_data: -0.005577284975345319
    double_data: -0.04171143054518582
    double_data: -0.04172185967457513
    double_data: -0.025676556492132633
    double_data: 0.03952360018220573
    double_data: -0.041180401400376265
    double_data: -0.02873946827946184
    double_data: -0.0024692943486277694
    double_data: -0.003898666862438853
    double_data: 0.09320296922260164
    double_data: 0.02113768520848988
    double_data: -0.06984961847553804
    double_data: 0.047132982427053084
    double_data: 0.037683694019786974
    double_data: -0.0029510545104023413
    double_data: 0.1678261406199617
    double_data: 0.07035138807848693
    double_data: 0.05177425868749418
    double_data: -0.07870299771804509
    double_data: -0.04127751211588063
    double_data: -0.02031265965114533
    double_data: -0.03229985271748389
    double_data: -0.05905726428520224
    double_data: -0.053234018944838375
    double_data: -0.02746571882232334
    double_data: 0.11259299833849312
    double_data: 0.13613195268310274
    double_data: -0.12083230647221023
    double_data: 0.055100926026536795
    double_data: 0.025804849970919412
    double_data: -0.00706467790869275
    double_data: 0.2519987083979348
    double_data: 0.012854032298989265
    double_data: -0.1450176251492184
    double_data: -0.15004457344045163
    double_data: -0.03000882573415993
    double_data: -0.01566247666215241
    double_data: -0.012277548670085554
    double_data: -0.045922226753543294
    double_data: -0.046742954145203415
    double_data: 0.009388652374350515
    double_data: 0.03611575139821848
    double_data: 0.12074618747238271
    double_data: -0.1443610919200625
    double_data: -0.014967380169406977
    double_data: 0.05463249117757395
    double_data: 0.03823040850946739
    double_data: 0.1360826264512367
    double_data: 0.030744189382491394
    double_data: -0.07258361314767071
    double_data: -0.10298755342629701
    double_data: 0.10164827128821731
    double_data: 0.039968648132522815
    double_data: -0.03499298436608129
    double_data: -0.14459698056729034
    double_data: 0.0686996599220353
    double_data: 0.03826727212262161
    double_data: 0.013288805908656828
    double_data: 0.004160408144042955
    double_data: -0.20034108398982683
    double_data: -0.05481754861637666
    double_data: 0.03700104253011377
    double_data: 0.05652595139050133
    double_data: 0.23590947156659578
    double_data: 0.022842493355799503
    double_data: 0.04672610371078567
    double_data: -0.016875846961028552
    double_data: 0.11070206734451389
    double_data: -0.0036024582702668985
    double_data: -0.04481009200081463
    double_data: -0.04819425806721538
    double_data: 0.10386041370183693
    double_data: 0.005982374568307701
    double_data: -0.03972979641322162
    double_data: -0.07220809569265081
    double_data: -0.1095498075488558
    double_data: 0.034163819181022174
    double_data: -0.058738366466856484
    double_data: 0.021441599919882447
    double_data: 0.11973162659945413
    double_data: -0.05720287382503389
    double_data: 0.10777124910261597
    double_data: -0.11170768354846165
    double_data: 0.3513679689034691
    double_data: 0.0429353926758188
    double_data: -0.030887352480119097
    double_data: -0.11446556658081437
    double_data: 0.13347381918828322
    double_data: 0.06707548047194792
    double_data: -0.06520261961564126
    double_data: -0.005492931303248584
    double_data: -0.20164932559953822
    double_data: -0.07228197544397623
    double_data: -0.021493433590592633
    double_data: 0.02415406069089033
    double_data: 0.24335917486556546
    double_data: 0.11485329827255976
    double_data: 0.16365710637309636
    double_data: -0.14714954902961702
    double_data: 0.13876814072015806
    double_data: 0.09340909436096675
    double_data: 0.017330319908503457
    double_data: -0.030276794391840712
    double_data: 0.05304458247292377
    double_data: 0.04059276837426849
    double_data: -0.042669934501138665
    double_data: 0.08843865179382786
    double_data: -0.07392836683142626
    double_data: 0.08598652919176762
    double_data: -0.14746826672267815
    double_data: 0.03625122494938323
    double_data: 0.3110936014543871
    double_data: 0.20614630690558577
    double_data: -0.04289652398550527
    double_data: -0.1721305101924864
    double_data: -0.0039565314869141185
    double_data: -0.048665551530449803
    double_data: -0.08233177403468958
    double_data: -0.060820717439152946
    double_data: 0.0024899165541504855
    double_data: -0.020134613769215118
    double_data: 0.010982612311701319
    double_data: 0.04842634897646873
    double_data: -0.12294657326565886
    double_data: 0.025965786074235286
    double_data: -0.038694693748490584
    double_data: -0.04498112448306153
    double_data: 0.13492537795331863
    double_data: 0.10952909414484768
    double_data: 0.02993607403204333
    double_data: -0.031308179624034205
    double_data: 0.043920502947416805
    double_data: 0.050151363953803624
    double_data: -0.029242691159285853
    double_data: 0.05598030837762346
    double_data: -0.06904348269186172
    double_data: 0.06601124697305909
    double_data: -0.04708828032733554
    double_data: -0.039597165463994485
    double_data: -0.10047680247009268
    double_data: 0.02520060259707394
    double_data: -0.1422240664504043
    double_data: 0.04892853785716843
    double_data: 0.09540035841028537
    double_data: 0.06606761844398042
    double_data: 0.036646510499625806
    double_data: -0.1206685450139558
    double_data: 0.04329274168330068
    double_data: 0.07371256941344831
    double_data: -0.057185244965190125
    double_data: -0.027442359320344847
    double_data: -0.007030942613997742
    double_data: 0.008828363558554361
    double_data: -0.02812404529986974
    double_data: -0.008313429043538344
    double_data: -0.05950107687219884
    double_data: -0.03329853661687796
    double_data: 0.042643987576931656
    double_data: 0.0539517566933452
    double_data: 0.07902922713985339
    double_data: 0.06942258158976154
    double_data: 0.043649541531979044
    double_data: -0.07667000880662002
    double_data: 0.03855424002758706
    double_data: -0.010493451194378786
    double_data: -0.07463199750378367
    double_data: -0.06569578183626447
    double_data: -0.01576246365509097
    double_data: -0.04416017269369661
    double_data: 0.06024370053404906
    double_data: 0.000637500795944877
