ir_version: 3
producer_name: "onnx-tensorflow"
graph {
  node {
    input: "Placeholder"
    output: "Cast"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 11
      type: INT
    }
  }
  node {
    input: "h1/weights"
    output: "h1/weights/read"
    name: "h1/weights/read"
    op_type: "Identity"
  }
  node {
    input: "Cast"
    input: "h1/weights/read"
    output: "h1/MatMul"
    name: "h1/MatMul"
    op_type: "MatMul"
  }
  node {
    input: "h1/biases"
    output: "h1/biases/read"
    name: "h1/biases/read"
    op_type: "Identity"
  }
  node {
    input: "h1/MatMul"
    input: "h1/biases/read"
    output: "h1/add"
    name: "h1/add"
    op_type: "Add"
    attribute {
      name: "broadcast"
      i: 1
      type: INT
    }
  }
  node {
    input: "h1/add"
    output: "h1/Relu"
    name: "h1/Relu"
    op_type: "Relu"
  }
  node {
    input: "h2/weights"
    output: "h2/weights/read"
    name: "h2/weights/read"
    op_type: "Identity"
  }
  node {
    input: "h1/Relu"
    input: "h2/weights/read"
    output: "h2/MatMul"
    name: "h2/MatMul"
    op_type: "MatMul"
  }
  node {
    input: "h2/biases"
    output: "h2/biases/read"
    name: "h2/biases/read"
    op_type: "Identity"
  }
  node {
    input: "h2/MatMul"
    input: "h2/biases/read"
    output: "h2/add"
    name: "h2/add"
    op_type: "Add"
    attribute {
      name: "broadcast"
      i: 1
      type: INT
    }
  }
  node {
    input: "h2/add"
    output: "h2/Relu"
    name: "h2/Relu"
    op_type: "Relu"
  }
  node {
    input: "h3/weights"
    output: "h3/weights/read"
    name: "h3/weights/read"
    op_type: "Identity"
  }
  node {
    input: "h2/Relu"
    input: "h3/weights/read"
    output: "h3/MatMul"
    name: "h3/MatMul"
    op_type: "MatMul"
  }
  node {
    input: "h3/biases"
    output: "h3/biases/read"
    name: "h3/biases/read"
    op_type: "Identity"
  }
  node {
    input: "h3/MatMul"
    input: "h3/biases/read"
    output: "h3/add"
    name: "h3/add"
    op_type: "Add"
    attribute {
      name: "broadcast"
      i: 1
      type: INT
    }
  }
  node {
    input: "h3/add"
    output: "h3/Relu"
    name: "h3/Relu"
    op_type: "Relu"
  }
  node {
    input: "output/weights"
    output: "output/weights/read"
    name: "output/weights/read"
    op_type: "Identity"
  }
  node {
    input: "h3/Relu"
    input: "output/weights/read"
    output: "output/MatMul"
    name: "output/MatMul"
    op_type: "MatMul"
  }
  node {
    input: "output/biases"
    output: "output/biases/read"
    name: "output/biases/read"
    op_type: "Identity"
  }
  node {
    input: "output/MatMul"
    input: "output/biases/read"
    output: "output/add"
    name: "output/add"
    op_type: "Add"
    attribute {
      name: "broadcast"
      i: 1
      type: INT
    }
  }
  name: "output/add"
  initializer {
    dims: 784
    dims: 32
    data_type: DOUBLE
    name: "h1/weights"
    double_data: -0.013868623828892698
    double_data: 0.03602953640000819
    double_data: 0.004066380250464186
    double_data: -0.05995479770011386
    double_data: 0.00444179373395836
    double_data: 0.027285040982241836
    double_data: -0.00664194756104887
    double_data: 0.044992519836115026
    double_data: 0.015050801736327358
    double_data: 0.018971969311539036
    double_data: -0.026713180117047392
    double_data: -0.011118665315086651
    double_data: -0.02284434248084867
    double_data: -0.017913915156270412
    double_data: 0.02885762763064821
    double_data: -0.018962896670166544
    double_data: -0.00818026160287696
    double_data: 0.01256302823964838
    double_data: -0.014704320656343159
    double_data: 0.048937353239095545
    double_data: 0.04496187665535206
    double_data: -0.043296866283597725
    double_data: 0.0060887384583794705
    double_data: -0.020759196153587945
    double_data: -0.013129299937438629
    double_data: 0.04333344945666636
    double_data: -0.022862912007186265
    double_data: 0.026669025035818465
    double_data: -0.005042604654438107
    double_data: 0.021999508701818556
    double_data: -0.02090746802511119
    double_data: 0.008701509362684589
    double_data: -0.008760173888154529
    double_data: 0.026179924183072606
    double_data: 0.004520600526857185
    double_data: 0.015976149181831715
    double_data: 0.06311798313949253
    double_data: -0.0011166258912285135
    double_data: -0.04969148069004784
    double_data: -0.02234006878615802
    double_data: 0.04628065589350535
    double_data: -0.03396043507601002
    double_data: -0.0016309880617247515
    double_data: -0.031893445703393634
    double_data: 0.0009013924023692089
    double_data: 0.01711756232069277
    double_data: 0.058033543433710595
    double_data: 0.0009075953416964066
    double_data: 0.004619542815326327
    double_data: 0.01898739837550949
    double_data: -0.026978205010665057
    double_data: 0.05372220860183986
    double_data: -0.054053672460372806
    double_data: -0.010393973760975875
    double_data: 0.016229021784413433
    double_data: -0.033339343006807444
    double_data: -0.05769618551913018
    double_data: 0.022228456972431074
    double_data: -0.001334725274555044
    double_data: -0.011252314286866289
    double_data: -0.00027856892384932346
    double_data: -0.017009836536658295
    double_data: -0.050987252696251664
    double_data: -0.029138841021184428
    double_data: 0.05598861240464342
    double_data: -0.003117509611188266
    double_data: 0.009660441372334658
    double_data: 0.03319952308384334
    double_data: 0.026599212118599596
    double_data: 0.002494126602901674
    double_data: 0.00259181121617435
    double_data: 0.04678004456149308
    double_data: 0.008325070220048438
    double_data: 0.011908383043629206
    double_data: 0.04392083956058299
    double_data: 0.011681679365547978
    double_data: -0.0431905523963519
    double_data: 0.010319461170142227
    double_data: 0.007105352234421076
    double_data: 0.030204728632078168
    double_data: -0.046039250621332684
    double_data: 0.05172143186516095
    double_data: -0.007442520322922484
    double_data: 0.03834305881574803
    double_data: -0.005147590958958961
    double_data: -0.008158255746456178
    double_data: 0.01239302128133234
    double_data: 0.0053196087778439325
    double_data: 0.011518807277795752
    double_data: -0.0239326630421547
    double_data: 0.0183800898878181
    double_data: -0.015956855337750032
    double_data: -0.021476737369682513
    double_data: -0.018286331959181685
    double_data: -0.04193451775371683
    double_data: -0.03471383635005939
    double_data: 0.040427845619263984
    double_data: 0.013698566506924508
    double_data: -0.025455134107896158
    double_data: 0.037205644114383554
    double_data: 0.010541198173546366
    double_data: -8.142237896752662e-05
    double_data: 0.033939980794083106
    double_data: 0.04399500612486823
    double_data: -0.020413253761217182
    double_data: -0.043694402868228295
    double_data: -0.052117550745271655
    double_data: -0.001633052682702873
    double_data: 0.02208057560245535
    double_data: -0.021481633100064387
    double_data: 0.033227760170033156
    double_data: -0.020090605459983125
    double_data: -0.007132073942504592
    double_data: -0.03419459115940589
    double_data: -0.029566772053916564
    double_data: 0.035737541598244466
    double_data: -0.010389803429328204
    double_data: -0.0021770484834536573
    double_data: 0.04361875699745326
    double_data: 0.05214714916568778
    double_data: -0.003986447837332089
    double_data: 0.009255728247579755
    double_data: 0.007600468190891437
    double_data: -0.07124291804977347
    double_data: -0.043107698846264926
    double_data: 0.031277876936949736
    double_data: 0.020140278185175015
    double_data: -0.03965214953293205
    double_data: 0.006051673415721927
    double_data: -0.0002053311154652618
    double_data: -0.04037518272545
    double_data: -0.035122248490389626
    double_data: -0.06352927705536966
    double_data: -0.026254593486632193
    double_data: 0.012002889817970253
    double_data: -0.06783302481788128
    double_data: -0.011214356544031976
    double_data: 0.0030554396031273155
    double_data: 0.005537130131071942
    double_data: 0.012625765934555833
    double_data: 0.0022855438250574834
    double_data: -0.021382010379924987
    double_data: 0.025885160901505097
    double_data: 0.00520305882143913
    double_data: -0.026439112756398885
    double_data: 0.031014968978078976
    double_data: 0.04032826608607182
    double_data: -0.027300679145066464
    double_data: 0.02673688420336557
    double_data: -0.01394303015680474
    double_data: -0.0028578220055697164
    double_data: 0.033386735918829596
    double_data: 0.03282095575358794
    double_data: 0.05261185448012654
    double_data: -0.017843952591003645
    double_data: -0.04724359749506677
    double_data: 0.04600482544677416
    double_data: -0.020829958074940508
    double_data: 0.014545961953694703
    double_data: 0.021427429802068635
    double_data: 0.0013440614409184846
    double_data: 0.043705391613875745
    double_data: 0.011657241059748403
    double_data: 0.0007575096055454099
    double_data: 0.02158572382178933
    double_data: -0.062373383523310635
    double_data: 0.03363858291081172
    double_data: -0.02263558800157123
    double_data: 0.023835226994875565
    double_data: -0.02479351564580054
    double_data: 0.0191137520839607
    double_data: -0.04598040368316983
    double_data: 0.01566736764535009
    double_data: -0.004331584290893834
    double_data: -0.021899862161933112
    double_data: -0.012382017535548233
    double_data: 0.03619326072787233
    double_data: -0.03393081671307397
    double_data: 0.02528618225916312
    double_data: -0.03588894843238517
    double_data: -0.0636193513074443
    double_data: -0.012942068286258579
    double_data: 0.058000102701535036
    double_data: 0.008531355451272182
    double_data: 0.003015031816757945
    double_data: -0.019170102115666207
    double_data: -0.014471221660348843
    double_data: -0.009403209470916463
    double_data: 0.009802725196281522
    double_data: -0.00272051428959375
    double_data: -0.0626676947807467
    double_data: 0.030529663391647543
    double_data: -0.01695132855331542
    double_data: 0.02416253399441707
    double_data: -0.007878537251739882
    double_data: -0.05443302209629695
    double_data: -0.013358643362093792
    double_data: 0.05110630654567183
    double_data: -0.014107398382297536
    double_data: -0.033361539985799916
    double_data: -0.02164197801757162
    double_data: 0.028177801446634516
    double_data: 0.03229784895185581
    double_data: 0.06652950242464717
    double_data: 0.029265604333671674
    double_data: -0.003749370994814868
    double_data: -0.00374163738646094
    double_data: -0.027635782667069363
    double_data: -0.018031850202770983
    double_data: 0.021545176602418566
    double_data: 0.05980373386977582
    double_data: 0.022785317038760317
    double_data: 0.007830080165688537
    double_data: -0.01357012199115075
    double_data: -0.06248434653680142
    double_data: -0.02036407207551905
    double_data: -0.01567097942132215
    double_data: -0.0013947499162284653
    double_data: 0.002710506181738292
    double_data: 0.013561412615731221
    double_data: -0.020776822762858433
    double_data: -0.003396283508366063
    double_data: 0.040349178414521195
    double_data: 0.05889243157440441
    double_data: 0.00943116105768396
    double_data: 0.009479506756409158
    double_data: -0.03199267574652263
    double_data: 0.023516639109953087
    double_data: -0.0004749335043436631
    double_data: 0.019415679621893295
    double_data: 0.020236158268450138
    double_data: 0.016486107185349073
    double_data: 0.04223196990352797
    double_data: 0.04826507151099943
    double_data: -0.012140402822170097
    double_data: -0.06202040549394139
    double_data: -0.006400011602166089
    double_data: -0.03268472606359419
    double_data: 0.007181712512463497
    double_data: -0.0110934271626975
    double_data: -0.006460785849478704
    double_data: -0.062976203955435
    double_data: -0.023660696419693164
    double_data: 0.02367480398143928
    double_data: -0.02974191552943917
    double_data: -0.015255429800698325
    double_data: 0.02508574127675716
    double_data: 0.003305121349835189
    double_data: -0.008190135904855969
    double_data: 0.030927746246231173
    double_data: -0.04033325096079456
    double_data: 0.010610740964351677
    double_data: -0.0009875425817927324
    double_data: -0.035751657801150784
    double_data: 0.06974344850156322
    double_data: -0.00947959985222937
    double_data: -0.007942978487102549
    double_data: -0.01943292046480674
    double_data: -0.04155256191427632
    double_data: 0.022319081990631578
    double_data: 0.058428728262297135
    double_data: 0.04267692546364248
    double_data: -0.021523122341769497
    double_data: -0.015051437026240119
    double_data: -0.008811420964978865
    double_data: -0.0017874390610566411
    double_data: 0.012284934131843422
    double_data: -0.04143405925488125
    double_data: 0.04885725658912987
    double_data: 0.018073850430203462
    double_data: 0.017565959213060756
    double_data: 0.021349115616679494
    double_data: -0.012761134508530005
    double_data: -0.05829555638971908
    double_data: 0.011382995480282149
    double_data: -0.0306333853219338
    double_data: 0.015935700399983727
    double_data: 0.04950902372890178
    double_data: 0.03628586307604556
    double_data: 0.014085697559279098
    double_data: 0.007248144146652466
    double_data: -0.008926567878149416
    double_data: -0.05053403392399386
    double_data: -0.022385392605050743
    double_data: -0.004647354260584289
    double_data: 0.01274423461684456
    double_data: -0.04192531488128295
    double_data: -0.02066750413602945
    double_data: 0.028809236543549083
    double_data: -0.014809023579199504
    double_data: -0.004746578242357079
    double_data: 0.005588182353173982
    double_data: -0.004616684080962725
    double_data: 0.031157225361890112
    double_data: -0.000789645962410663
    double_data: 0.04000482456458101
    double_data: 0.06223337195192575
    double_data: -0.005319462395389754
    double_data: -0.03451995719278165
    double_data: 0.016316183734994077
    double_data: 0.02959225833551475
    double_data: -0.0262771533292822
    double_data: -0.005027516486716665
    double_data: 0.0004885291380938516
    double_data: -0.013236803547287226
    double_data: -0.01742372110144994
    double_data: -0.02005348863587922
    double_data: 0.05832812833036953
    double_data: -0.0007729641447878439
    double_data: 0.022613281765796085
    double_data: 0.06895185853844418
    double_data: 0.016495138035880336
    double_data: -0.031166169717597086
    double_data: -0.0163715688266708
    double_data: -0.03650561166181848
    double_data: 0.048268143458974955
    double_data: 0.0005394350232956391
    double_data: 0.02269812799556141
    double_data: 0.004768081626168302
    double_data: 0.01933119269759717
    double_data: -0.020004848754925992
    double_data: -0.025234716786491394
    double_data: -0.010642063966085495
    double_data: 0.0050221776838799085
    double_data: 0.029216387997360153
    double_data: -0.034126758874554984
    double_data: 0.04373066041182125
    double_data: 0.010881345424489508
    double_data: 0.025094527974915265
    double_data: -0.056546505355917834
    double_data: 0.01630525250132786
    double_data: 0.007892960656030503
    double_data: 0.02268635339603538
    double_data: 0.050314985527632035
    double_data: 0.018809436319350777
    double_data: -0.0010924289253385184
    double_data: -0.01007262803983202
    double_data: 0.06813582739908074
    double_data: 0.05566936180063663
    double_data: -0.022350724659326197
    double_data: -0.0013409198012215458
    double_data: 0.018922210721759276
    double_data: 0.041303424367943334
    double_data: -0.03981311786510882
    double_data: -0.009241820249809395
    double_data: 0.029828576423424125
    double_data: 0.04611599943848828
    double_data: 0.0050950622191469125
    double_data: 0.01224350045823559
    double_data: -0.01850613181039049
    double_data: -0.05230165549028795
    double_data: 0.017444448857434004
    double_data: 0.019357602877371215
    double_data: -0.046263807929602094
    double_data: 0.011628475863218708
    double_data: -0.005731047027909513
    double_data: -0.0078084002692666655
    double_data: -0.03415420312251397
    double_data: -0.005906821760723651
    double_data: -0.003223973387336359
    double_data: 0.029831703754450472
    double_data: -0.004663566660909926
    double_data: 0.030331081771263802
    double_data: -0.022402371489050155
    double_data: 0.004317489648980766
    double_data: -0.062329380955407264
    double_data: 0.05068741025042071
    double_data: 0.001976583017653757
    double_data: -0.020532972391317433
    double_data: -0.024407630337860267
    double_data: 0.011925681222563331
    double_data: -0.016703254159472294
    double_data: 0.0320545376626943
    double_data: 0.012976186033917732
    double_data: -0.014264803636013465
    double_data: -0.04439089795352697
    double_data: -0.025516462013953887
    double_data: 0.014378214010785687
    double_data: 0.05008931554289145
    double_data: 0.00241476120774823
    double_data: -0.04984885395179536
    double_data: -0.06289154178404581
    double_data: -0.0551622899023914
    double_data: -0.00032932074455324444
    double_data: 0.042226739351711055
    double_data: 0.01354835826082927
    double_data: -0.016773601079645387
    double_data: -0.008044138316028746
    double_data: -0.013933452049834958
    double_data: 0.02919646271110203
    double_data: 0.003349655512853758
    double_data: 0.04148438372311373
    double_data: -0.03196608993236327
    double_data: -0.02447682067670431
    double_data: -0.046309157459501746
    double_data: -0.05675053208567105
    double_data: 0.02716442868321011
    double_data: -0.058894165333535024
    double_data: 0.0004114904290178298
    double_data: 0.029330030373341268
    double_data: 0.06515620021757819
    double_data: -0.025930341555704516
    double_data: 0.009814729856144448
    double_data: -0.02672704201233742
    double_data: 0.04685441731037174
    double_data: 0.03781544702181608
    double_data: 0.004998872557558837
    double_data: -0.028025872657780698
    double_data: 0.01716833478264729
    double_data: -0.03174181634288753
    double_data: -0.04690443197905982
    double_data: 0.031338215734898034
    double_data: -0.022836316811624905
    double_data: 0.029285394434123285
    double_data: 0.037564090318968665
    double_data: -0.06868355037912346
    double_data: 0.02040619247988457
    double_data: 0.0010949438688476574
    double_data: 0.02694108922437487
    double_data: 0.054512027573127474
    double_data: 0.02056034224831543
    double_data: -0.02358146583623855
    double_data: -0.00244398147195318
    double_data: 0.00018916351727992818
    double_data: -0.052876809364124894
    double_data: 0.001404740509651141
    double_data: -0.012115162115265395
    double_data: 0.023636020278500702
    double_data: 0.009042634543038044
    double_data: -0.048279989890063574
    double_data: 0.00805622250341658
    double_data: -0.011624075857798824
    double_data: 0.016718280654239477
    double_data: 0.012311185930428735
    double_data: 0.0030255994440751494
    double_data: -0.0016563943192327434
    double_data: 0.004709628477400819
    double_data: -0.06350039107602251
    double_data: -0.021700183462707103
    double_data: -0.06283719749104225
    double_data: -0.02703620626250813
    double_data: -0.06800329677073261
    double_data: 0.04253175115669965
    double_data: -0.0015809471799597757
    double_data: 0.043830352789547236
    double_data: -0.015011178614486555
    double_data: 0.0024985559603862605
    double_data: 0.02674239841843552
    double_data: 0.016275202609098878
    double_data: -0.008533751395432982
    double_data: -0.009764304980047317
    double_data: -0.014405776453502534
    double_data: 0.04793276750512773
    double_data: -0.027673436404542808
    double_data: -0.022902664956499764
    double_data: 0.017222174130054266
    double_data: -0.05096479062781195
    double_data: -0.032898275100408325
    double_data: -0.0223273814818359
    double_data: 0.05422083261940312
    double_data: -0.009563411049811179
    double_data: -0.004025929818299263
    double_data: -0.044901553651394484
    double_data: -0.0019497078932927431
    double_data: 0.014325891152004755
    double_data: -0.028657958892142215
    double_data: 0.030382368488745422
    double_data: -0.01014994364655016
    double_data: -0.04546081571058544
    double_data: -0.06541154659464342
    double_data: -0.006832659573441595
    double_data: 0.04642965531288429
    double_data: 0.0585681976286671
    double_data: 0.018108798510363636
    double_data: -0.016042233314712863
    double_data: 0.0385440977261729
    double_data: 0.02058130490098756
    double_data: -0.052946298503291085
    double_data: -0.04915214447001659
    double_data: 0.014854667376022488
    double_data: 0.028345660811720942
    double_data: -0.014040162775541805
    double_data: -0.04626699403249631
    double_data: -0.04327925911687785
    double_data: 0.0012197182359437193
    double_data: -0.004234791957214954
    double_data: 0.020253911059645587
    double_data: 0.04360585302123698
    double_data: -0.006029853831186649
    double_data: 0.04206813932044912
    double_data: 0.030208394767546807
    double_data: -0.007815651835552532
    double_data: 0.03764491877197364
    double_data: -0.02336799695014463
    double_data: 0.047445641291928575
    double_data: 0.030788226943514643
    double_data: 0.019791263834026268
    double_data: -0.07080854722405124
    double_data: -0.053625158372612405
    double_data: -0.032971783563416776
    double_data: -0.014180403142549602
    double_data: -0.033825300468026225
    double_data: 0.022683994434974267
    double_data: -0.03101565528929047
    double_data: -0.02938244753665028
    double_data: -0.045587707286026895
    double_data: 0.025371017292640605
    double_data: -0.015402857947363666
    double_data: -0.047052343173379585
    double_data: -0.011410225570628502
    double_data: -0.01667101124165266
    double_data: -0.01002078914735111
    double_data: 0.013576085882926353
    double_data: -0.0016625513034989807
    double_data: 0.05512034094612725
    double_data: 0.006960691334580123
    double_data: -0.06731582008224649
    double_data: -0.04013726445477849
    double_data: -0.01697177209298983
    double_data: -0.009931711623593258
    double_data: 0.050952113714157164
    double_data: -0.00020610872647892008
    double_data: -0.056174413570664355
    double_data: 0.037337809360724186
    double_data: 0.01467861130114149
    double_data: 0.004000461706814015
    double_data: 0.00807574163149958
    double_data: -0.006058630262750192
    double_data: -0.012592914076647171
    double_data: 0.022530036102554902
    double_data: -0.033138666345604244
    double_data: 0.007715343882124683
    double_data: -0.05434614523540993
    double_data: 0.019486978732195084
    double_data: 0.011773440061567888
    double_data: -0.03961204417991343
    double_data: 0.02338868823689557
    double_data: 0.02088496171779031
    double_data: -0.028870738823771048
    double_data: 0.05778669482284119
    double_data: -0.019878848397688175
    double_data: 0.011044783921532365
    double_data: -0.008240208432490943
    double_data: 0.009870008344241902
    double_data: -0.0443946518234117
    double_data: -0.0013720579946763867
    double_data: 0.046971705573590136
    double_data: -0.014615358093538363
    double_data: 0.0007994054189560023
    double_data: -0.01680458355014453
    double_data: -0.02391637770232079
    double_data: -0.06707358895529054
    double_data: -0.0015090538082003
    double_data: -0.015563754510827272
    double_data: 0.004146175899612028
    double_data: -0.006572719745648997
    double_data: -0.030433802615787042
    double_data: 0.021918252931460703
    double_data: -0.0075351294097417525
    double_data: -0.018389809149164275
    double_data: 0.004334097496295138
    double_data: 0.028408762202432335
    double_data: 0.006775537115092028
    double_data: 0.00510888834292954
    double_data: -0.04899011031688513
    double_data: 0.044115994685195115
    double_data: 0.008862578803858275
    double_data: 0.062017173449335966
    double_data: -0.021801868736200575
    double_data: -0.006539517868688942
    double_data: 0.06757448763204937
    double_data: 0.003304620934351343
    double_data: -0.0355683072112641
    double_data: 0.0454029586806069
    double_data: -0.04168271354405817
    double_data: 0.023415280997341525
    double_data: -0.012345353108299659
    double_data: -0.023596560017581095
    double_data: 0.011372876160233365
    double_data: -0.030037953033463717
    double_data: 0.03747794286677558
    double_data: -0.04362640995612504
    double_data: 0.03455812384819524
    double_data: -0.039707423961938215
    double_data: 0.029488874483923917
    double_data: -0.003673206931653636
    double_data: -0.005403531764060222
    double_data: 0.0077441942341397296
    double_data: 0.03176735513853246
    double_data: -0.003844116408189972
    double_data: -0.011812560539125513
    double_data: -0.043070937882921045
    double_data: 0.04468666264897057
    double_data: -0.02565761681903659
    double_data: 0.030619610689499963
    double_data: 0.04849030926024162
    double_data: -0.0046105127186825525
    double_data: 0.03807515395611926
    double_data: 0.04419367424598704
    double_data: 0.045838332939200144
    double_data: 0.01911109188510178
    double_data: 0.03360106727039004
    double_data: -0.030284458521693234
    double_data: -0.06480296909418197
    double_data: -0.0074011168461428955
    double_data: -0.0003587771549294038
    double_data: -0.01517943219811874
    double_data: 0.0007226166105869879
    double_data: 0.007756421570161086
    double_data: -0.015010972631361238
    double_data: 0.0489761534671509
    double_data: 0.059298466437166776
    double_data: -0.004828687019670356
    double_data: -0.013804680257218607
    double_data: 0.047796085907878
    double_data: -0.04224814535684005
    double_data: 0.0064002687526379205
    double_data: 0.05083293808178219
    double_data: 0.007758035405690321
    double_data: -0.013554137829722495
    double_data: -0.03893850583868305
    double_data: 0.0425524550839539
    double_data: -0.046015202512253904
    double_data: 0.03837141314111919
    double_data: 0.05270805586370416
    double_data: 0.032638185224328334
    double_data: 0.012614308161521084
    double_data: 0.06904824441451358
    double_data: 0.002330300095502018
    double_data: -0.03663795012824466
    double_data: 0.018777608144067537
    double_data: 0.01616701930645082
    double_data: -0.002257296578628634
    double_data: -0.009060990480519173
    double_data: -0.011158949003495598
    double_data: -0.03835295066143771
    double_data: 0.05681444900491732
    double_data: -0.017309772157972705
    double_data: 0.025124190865491274
    double_data: 0.01591278483752161
    double_data: -0.006699639355693677
    double_data: -0.03592902631825008
    double_data: -0.030051535903141247
    double_data: -0.0021646247116247695
    double_data: 0.03157552199712634
    double_data: 0.030755829405986
    double_data: 0.037413367561772395
    double_data: 0.0288865455227455
    double_data: -0.01039177926804111
    double_data: 0.00546008419986569
    double_data: -0.006029556955323211
    double_data: 0.025364418987819642
    double_data: 0.005439188868748064
    double_data: -0.0037583589854616574
    double_data: -0.024812603365761632
    double_data: -0.04421665412170912
    double_data: -0.01873979470169224
    double_data: -0.01603734121005093
    double_data: -0.013159417673802012
    double_data: -0.034330998114130186
    double_data: 0.0004953912339689279
    double_data: -0.049040538035377786
    double_data: 0.05151884692434868
    double_data: -0.00488071524006834
    double_data: -0.04355169608992584
    double_data: -0.021747049767888556
    double_data: -0.0015412654145584084
    double_data: -0.02091758671577665
    double_data: 0.01470941522223081
    double_data: 0.013458286844084972
    double_data: -0.04041817830471741
    double_data: 0.04943990090317517
    double_data: -0.07065461369470129
    double_data: 0.02182452987275978
    double_data: 0.007577069958177679
    double_data: -0.03814149293825969
    double_data: -0.024773565172089552
    double_data: -0.044409973686544646
    double_data: 0.04658232042208039
    double_data: -0.0028301290542697755
    double_data: 0.02249984661677077
    double_data: 0.018847364810451142
    double_data: -0.024517690157099262
    double_data: 0.01850881078945366
    double_data: 0.037791545793856185
    double_data: 0.024410250227706015
    double_data: -0.0034451802303752223
    double_data: 0.018662311602558088
    double_data: -0.013674229619560512
    double_data: -0.033992151478590305
    double_data: -0.006693262757007136
    double_data: 0.036983029184611334
    double_data: 0.028587615695822563
    double_data: -0.015818070671654947
    double_data: -0.06410308721480963
    double_data: -0.05327133971684636
    double_data: 0.03932110820772498
    double_data: -0.0666728734232349
    double_data: 0.05160013146550878
    double_data: 0.030972974949457673
    double_data: 0.057253913758261006
    double_data: 0.037662557989917335
    double_data: -0.05029444688367766
    double_data: -0.013331387323127915
    double_data: -0.03235370316630881
    double_data: -0.005118659760244013
    double_data: 0.005711950268966389
    double_data: -0.022196588020263915
    double_data: -0.03513244689502197
    double_data: 0.025250966741059797
    double_data: 0.055207697732507
    double_data: -0.04032681932079945
    double_data: -0.054649661944255384
    double_data: 0.045095319111581135
    double_data: 0.04926245448970891
    double_data: 0.0020639313690672626
    double_data: 0.03843531077471105
    double_data: -0.013968131201427142
    double_data: -0.00357459619283563
    double_data: -0.02887411653749155
    double_data: 0.0019470860142899438
    double_data: 0.029068388397605463
    double_data: 0.0048948345006036365
    double_data: -0.005381454722146645
    double_data: 0.0106496755783344
    double_data: -0.01326260241527447
    double_data: -0.015906213284003948
    double_data: -0.017004374393140603
    double_data: 0.028103323851860762
    double_data: 0.014594293149001904
    double_data: 0.01358900314942476
    double_data: -0.04206123972542547
    double_data: -0.007025469340696589
    double_data: 0.05570392863647158
    double_data: 0.0034427642046508922
    double_data: 0.04437552160891651
    double_data: 0.050787564903030116
    double_data: -0.000398729743495525
    double_data: 0.011688060229084918
    double_data: 0.029162144384730315
    double_data: -0.024041251295148905
    double_data: 0.03407432496351782
    double_data: 0.010514792753406436
    double_data: 0.006962796905360305
    double_data: 0.010502890651131988
    double_data: -0.009488925818122801
    double_data: 0.03566150752240904
    double_data: 0.01757800913675361
    double_data: -0.04797531521567898
    double_data: 0.018764769285780483
    double_data: 0.018989192936215933
    double_data: -0.0018363156555109498
    double_data: -0.015940268355362455
    double_data: 0.041248619759728225
    double_data: -0.04813458212043051
    double_data: 0.020690505104554027
    double_data: -0.06349904284041345
    double_data: -0.00902831087984413
    double_data: -0.034468253635337155
    double_data: 0.034580567879734514
    double_data: -0.018073158078257354
    double_data: -0.05101791121047396
    double_data: -0.0015480937742933369
    double_data: 0.019773565179403766
    double_data: -0.010653525718999583
    double_data: -0.026718345326059503
    double_data: -0.0002754928631789225
    double_data: -0.00876657555811705
    double_data: -0.020146933072793267
    double_data: -0.004274152541198662
    double_data: 0.004099341187829969
    double_data: -0.035078981215349574
    double_data: -0.010798340116775305
    double_data: -0.03634677298798714
    double_data: 0.05555675621873437
    double_data: 0.02106443401624158
    double_data: -0.025648948546373326
    double_data: 0.04627662258993939
    double_data: -0.04008558562123333
    double_data: -0.00671288888759813
    double_data: 0.008550910952298683
    double_data: -0.007212765354466612
    double_data: 0.009506375990970192
    double_data: -0.03964841925454948
    double_data: -0.008761171106210832
    double_data: -0.0200254491308663
    double_data: 0.05069162590684402
    double_data: 0.0014492714249703155
    double_data: 0.04780285306906381
    double_data: -0.06797825144376445
    double_data: -0.026905135147011077
    double_data: 0.028698767346149394
    double_data: -0.019007462404831463
    double_data: -0.008187309120019198
    double_data: 0.01995057066163324
    double_data: 0.0012615827134956248
    double_data: 0.008756911075853649
    double_data: 0.01713901202284729
    double_data: 0.03598935171758407
    double_data: -0.01490110570441768
    double_data: -0.019716159725351217
    double_data: 0.05801705568620395
    double_data: 0.01925820819791146
    double_data: 0.007857610551431719
    double_data: 0.03162259655734372
    double_data: 0.044379772088250745
    double_data: -0.04703741561893553
    double_data: 0.045730730871326786
    double_data: -0.041424058448424735
    double_data: -0.004531076725424425
    double_data: 0.03863043612637739
    double_data: -0.0591951356535485
    double_data: 0.030103595142653976
    double_data: -0.04257364534317578
    double_data: -0.031070264244733914
    double_data: -0.040454772985203925
    double_data: -0.015528782806973633
    double_data: -0.00014019068605503957
    double_data: -0.012841659922158166
    double_data: -0.007224164506707825
    double_data: -0.015600619710331517
    double_data: 0.04284141832196583
    double_data: 0.006748547809633313
    double_data: -0.00858602810266823
    double_data: -0.005477360670234951
    double_data: -0.04550783700728546
    double_data: -0.018766067779112484
    double_data: 0.014620973363615324
    double_data: -0.01755455315182324
    double_data: -0.012652383882037613
    double_data: -0.015918617934062292
    double_data: -0.04237735865127868
    double_data: 0.006307265510136224
    double_data: -0.0323747859563428
    double_data: 0.018669685670172635
    double_data: 0.05889142210392053
    double_data: -0.040889115956235955
    double_data: -0.03664228899696788
    double_data: -0.010654640972136661
    double_data: 0.011695542318633508
    double_data: -0.010218892070102032
    double_data: -0.016323816523894343
    double_data: 0.02108693583983382
    double_data: -0.004418548924378671
    double_data: 0.048322288651062605
    double_data: -0.036652726781249395
    double_data: -0.00862620885517953
    double_data: 0.029352947969561314
    double_data: 0.013050993505012268
    double_data: -0.015811155738704723
    double_data: 0.006495543323058808
    double_data: -0.0008101895845983079
    double_data: 0.005446204510699164
    double_data: -0.005469892020552773
    double_data: -0.04991875607814711
    double_data: -0.005901687469450371
    double_data: -0.019732952663922637
    double_data: -0.02536641899902009
    double_data: -0.005203525363882428
    double_data: 0.03400581464312508
    double_data: -0.010953865544378294
    double_data: -0.018977583351091436
    double_data: -0.05589968237184357
    double_data: 0.02783633164766483
    double_data: 0.04003003142828657
    double_data: -0.01396263842187287
    double_data: -0.027839933738832295
    double_data: -0.033241540305630944
    double_data: -0.009570573656062193
    double_data: 0.06292515024514934
    double_data: -0.037543923385077754
    double_data: 0.0006874403447484286
    double_data: -0.0198874305514335
    double_data: -0.009166717116474344
    double_data: 0.06635494277800948
    double_data: -0.01755109746111504
    double_data: -0.04107624109125142
    double_data: -0.016539057228894347
    double_data: 0.012625086665725834
    double_data: -0.02456088830883007
    double_data: -0.011999750398069905
    double_data: 0.02957913599915079
    double_data: 0.06169551960573757
    double_data: -0.008998649165690693
    double_data: 0.00892793604546501
    double_data: 0.021084850986130544
    double_data: -0.06588599468709216
    double_data: 0.024288540468040735
    double_data: 0.04852615381758777
    double_data: 0.04482165885116909
    double_data: 0.008152907129596099
    double_data: 0.015442042890853745
    double_data: 0.05025510020397909
    double_data: -0.028404796675675813
    double_data: -0.04571515991726029
    double_data: -0.01530836289516233
    double_data: 0.04239163534548185
    double_data: -0.013589870127594482
    double_data: 0.0009232839014955928
    double_data: 0.014313834894110243
    double_data: 0.04951049861067561
    double_data: -0.04785195058402673
    double_data: 0.017411393591246535
    double_data: -0.06969578475119477
    double_data: 0.0006623271712231938
    double_data: -0.013176423832153153
    double_data: -0.05414366300102222
    double_data: -0.022382820556339122
    double_data: 0.04642454461726312
    double_data: 0.045461669189924094
    double_data: -0.0029027042104044437
    double_data: 0.0011902350346038564
    double_data: -0.003403688446666352
    double_data: -0.04170193556120875
    double_data: -0.024551029539629243
    double_data: -0.011074756525391749
    double_data: 0.024447178247717152
    double_data: -0.019795067407969064
    double_data: 0.04110493516962438
    double_data: 0.022352785390739777
    double_data: -0.006367025869065368
    double_data: 0.014666923712289144
    double_data: -0.003173669934129384
    double_data: 0.01787144970380412
    double_data: -0.05374248221410022
    double_data: -0.006224192909828568
    double_data: 0.05337700006904569
    double_data: 0.008538583440182467
    double_data: -0.012205709809899221
    double_data: -0.02370335392934527
    double_data: 0.04680546151158105
    double_data: -0.04753674098706807
    double_data: -0.011537712700427973
    double_data: 0.015173080110882663
    double_data: 0.029495458611547048
    double_data: 0.01629613712441517
    double_data: 0.005904400873339003
    double_data: 0.05926081240689701
    double_data: 0.024318981271206807
    double_data: 0.0039230206794407035
    double_data: -0.019600793921601696
    double_data: -0.01910936874130274
    double_data: 0.04004951442995433
    double_data: 0.011039561689358532
    double_data: 0.0008698315793497338
    double_data: 0.02922487936072935
    double_data: -0.016209745826668603
    double_data: -0.003612868826915033
    double_data: -0.019283727540680404
    double_data: -0.03359219819047227
    double_data: 0.04798043799792838
    double_data: -0.0701953433682012
    double_data: 0.049109106994451354
    double_data: -0.05827672282955252
    double_data: -0.02841729560819996
    double_data: -0.024767194063566995
    double_data: -0.03594909167714951
    double_data: -0.01608512557868676
    double_data: -0.005182342766824805
    double_data: 0.005291494647765947
    double_data: 0.002288985072022031
    double_data: -0.02776321091918807
    double_data: 0.05151394750141364
    double_data: 0.01444592293883316
    double_data: -0.03796574940744988
    double_data: -0.0036924811022999854
    double_data: -0.037210371651961796
    double_data: 0.02802884766576543
    double_data: 0.011366733989750112
    double_data: 0.040299740249149583
    double_data: -0.019138980410938203
    double_data: 0.023117806000328534
    double_data: -0.06558070321099141
    double_data: 0.016383383310352845
    double_data: 0.0021770081320762916
    double_data: -0.009443794614489846
    double_data: 0.04120543929814559
    double_data: 0.061566508077385534
    double_data: 0.012658255923490671
    double_data: -0.012525788182182423
    double_data: -0.021095072323454263
    double_data: -0.057272957031228235
    double_data: 0.035444326862334695
    double_data: -0.005990838144201779
    double_data: 0.003449448011706758
    double_data: -0.029438788439994996
    double_data: -0.009809723934442321
    double_data: -0.02795547567968572
    double_data: -0.024735739793059104
    double_data: -0.063436906064215
    double_data: -0.014233822784289495
    double_data: -0.04171800393796922
    double_data: -0.016021181245254902
    double_data: -0.006137150424784807
    double_data: 0.016568980306009132
    double_data: -0.053079971928586614
    double_data: -0.05879236444674493
    double_data: 0.009783879340457012
    double_data: -0.004833164741265811
    double_data: 0.01087304871862838
    double_data: -0.05467547107618133
    double_data: 0.007750408748164139
    double_data: 0.011417854816238119
    double_data: -0.023500502297696305
    double_data: 0.04810241597447644
    double_data: 1.5313803694843513e-05
    double_data: -0.026268220779465643
    double_data: 0.024358339301542555
    double_data: -0.05861443541355554
    double_data: -0.02390355202646701
    double_data: 0.004190040088752806
    double_data: 0.03836649685886916
    double_data: 0.01859500309661874
    double_data: -0.011166215397260194
    double_data: 0.01802678410958057
    double_data: 0.05661765179522783
    double_data: 0.0024102233255232446
    double_data: -0.014845869602119866
    double_data: 0.02638106504054686
    double_data: -0.01634411369876158
    double_data: 0.018025334819718658
    double_data: 0.002606175471976948
    double_data: -0.01053824299083883
    double_data: 0.03797131062102239
    double_data: -0.04441880691405314
    double_data: -0.04214350909684384
    double_data: 0.016695785312928306
    double_data: -0.03907124708642797
    double_data: 0.030584113893711608
    double_data: -0.03995577146560891
    double_data: 0.023088763006383697
    double_data: -0.04188839070416406
    double_data: -0.0613855815806601
    double_data: -0.06336806068079134
    double_data: -0.05396332742168265
    double_data: -0.023516320942698222
    double_data: 0.005035974160241503
    double_data: -0.03491144446123793
    double_data: 0.03319817518902049
    double_data: 0.010006385793115203
    double_data: -0.03936192023782185
    double_data: 0.02756813405662173
    double_data: 0.022694305130878317
    double_data: -0.04804499781009749
    double_data: -0.02269529673557272
    double_data: 0.010363551635160196
    double_data: 0.041613551647012886
    double_data: 0.027006280090184246
    double_data: -0.02431509081217959
    double_data: 0.025507744586068432
    double_data: -0.03501796653332981
    double_data: -0.019070473033915646
    double_data: -0.02631227237253983
    double_data: 0.00047899830043470924
    double_data: -0.023722495439785753
    double_data: -0.04591900508257603
    double_data: -0.06877987664991238
    double_data: -0.012303500813457564
    double_data: 0.02715460304184624
    double_data: 0.012372297980105394
    double_data: -0.0391052092034454
    double_data: -0.008616751113049029
    double_data: -0.00111476007992331
    double_data: 0.052287705928359365
    double_data: 0.04310689235295962
    double_data: 0.06206064367440878
    double_data: -0.029760037967295053
    double_data: 0.0687534141239945
    double_data: -0.04634820414171929
    double_data: 0.03511174954480689
    double_data: -0.022840259352443246
    double_data: -0.00024742953297193017
    double_data: 0.052840811176578684
    double_data: -0.054810350196988364
    double_data: 0.020367105280187273
    double_data: -0.029687996985841632
    double_data: -0.04033040325802065
    double_data: 0.049353458939400546
    double_data: -0.03843409380096976
    double_data: 0.01988617316836437
    double_data: 0.0012562470791126971
    double_data: 0.01255615758719777
    double_data: -0.015220818088066117
    double_data: 0.010567694940999467
    double_data: 0.013899751307526456
    double_data: -0.05249752150071759
    double_data: -0.06699138822370382
    double_data: -0.017222785085966294
    double_data: 0.004080544270724848
    double_data: -0.03412725268206788
    double_data: -0.05515248355914847
    double_data: -0.057247388499722704
    double_data: 0.0001322879854167648
    double_data: -0.052271121128017364
    double_data: 0.00036640981196063696
    double_data: -0.01837797738050646
    double_data: 0.04275963113130876
    double_data: 0.05221746310504474
    double_data: -0.011163028795225082
    double_data: 0.011114528630731911
    double_data: -0.014431614568767076
    double_data: -0.037269857412786614
    double_data: -0.03308624399853005
    double_data: -0.035269516004745295
    double_data: 0.04791606092570839
    double_data: -0.02744570585930864
    double_data: 0.03455854280144549
    double_data: -0.011953391146768527
    double_data: -0.044682782078096395
    double_data: 0.026593979092752185
    double_data: -0.040791934562508625
    double_data: -0.02024817736187957
    double_data: 0.010026506617429232
    double_data: 0.013483700862564906
    double_data: -0.02836359429346209
    double_data: -0.003657301323515758
    double_data: 0.015980238126025583
    double_data: 0.023677978061745972
    double_data: -0.001005829252823339
    double_data: 0.04041205566264234
    double_data: -0.007963850791537892
    double_data: -0.028394389014290734
    double_data: 0.023951781371461735
    double_data: 0.0657748767477998
    double_data: 0.031219867376641734
    double_data: 0.034841152357911395
    double_data: -0.0359065960474748
    double_data: 0.034134385732525994
    double_data: -0.04106718086767581
    double_data: -0.04833415271755708
    double_data: -0.00011001634453642402
    double_data: 0.04955781690587991
    double_data: 0.01265706656025702
    double_data: -0.05679509565840637
    double_data: -0.00676055353018497
    double_data: -0.04979730019231893
    double_data: -0.027096604582375367
    double_data: 0.00015479913431944983
    double_data: 0.06573109792921465
    double_data: 0.03676838738396221
    double_data: 0.04925703167785785
    double_data: 0.010943437986254452
    double_data: -0.047742443207266165
    double_data: 0.01012700994642524
    double_data: -0.05926769341181951
    double_data: 5.732774408359248e-06
    double_data: -0.010690618120564098
    double_data: -0.0047203069404332595
    double_data: -0.005777401071317295
    double_data: -0.014210160507813464
    double_data: -0.039933616614311385
    double_data: 0.03939938828393234
    double_data: -0.011477631214899161
    double_data: -0.010331926781128667
    double_data: 0.017100210459339453
    double_data: -0.0003414000426739014
    double_data: -0.010606434209651804
    double_data: 0.011971031751918722
    double_data: 0.037103674438453534
    double_data: 0.05958790326123185
    double_data: 0.031114131538446617
    double_data: 0.04435163659871907
    double_data: -0.0032700669859581886
    double_data: -0.002254648515889876
    double_data: 0.039661740972325686
    double_data: 0.024861807280370577
    double_data: 0.038538289042176405
    double_data: 0.015666948889791726
    double_data: -0.003029405052435409
    double_data: -0.014612526369826446
    double_data: -0.0015161922157644716
    double_data: -0.0004251476786599293
    double_data: -0.026003662974296963
    double_data: -0.019707285371208205
    double_data: 0.043810278307708735
    double_data: -0.04528561403927541
    double_data: 0.0077591051297331995
    double_data: 0.004210678206084725
    double_data: -0.028135173455184265
    double_data: -0.014219665719107263
    double_data: -0.0009551440635747033
    double_data: -0.06571593204104359
    double_data: -0.03793817673784655
    double_data: -0.020506830045006197
    double_data: -0.06369629918124572
    double_data: 0.023786019875233714
    double_data: -0.0042921410232869646
    double_data: -0.0015084338978994642
    double_data: 0.008133810859494913
    double_data: -0.04915607552345889
    double_data: 0.03845473871654766
    double_data: 0.03497707689344829
    double_data: 0.007573083828287363
    double_data: 0.014276074896386213
    double_data: -0.06903055311999304
    double_data: -0.008032949108830062
    double_data: -0.009005201056408983
    double_data: 0.06509640108699888
    double_data: 0.007133956150010469
    double_data: -0.03485641430676597
    double_data: 0.019833610459693212
    double_data: 0.026536737412008203
    double_data: -0.017287569116264456
    double_data: 0.027645892812348423
    double_data: 0.0015501674941680924
    double_data: 0.029440201103789046
    double_data: -0.00976364449300423
    double_data: 0.012512022503959153
    double_data: 0.01281944987614963
    double_data: -0.04629186866208995
    double_data: -0.020468895172724322
    double_data: 0.0073470734297896535
    double_data: -0.000561116467086004
    double_data: 0.03555419194753284
    double_data: -0.0395002145864955
    double_data: 0.011409424760166376
    double_data: -0.007556749384591694
    double_data: 0.004069940059417679
    double_data: -0.025844079598686256
    double_data: 0.03765370681770643
    double_data: -0.004562822504119411
    double_data: -0.003977256180984067
    double_data: 0.023326015417176063
    double_data: -0.03633452148766715
    double_data: 0.058385471404384943
    double_data: -0.0160132007504517
    double_data: 0.03557287284008392
    double_data: 0.009921226176289981
    double_data: 0.008249275348821252
    double_data: -0.03468666909900125
    double_data: -0.011643038920856486
    double_data: 0.003921372762674254
    double_data: -0.058415025356772364
